{
    "request": {
        "name": "Amitabh Bachchan",
        "title": "Actor",
        "year": 1942,
        "month": 10,
        "day": 11,
        "hour": 16,
        "minute": 0,
        "second": 0,
        "latitude": 25.4381302,
        "longitude": 81.8338005,
        "location": "Allahabad",
        "agyat_rating": "AA",
        "about": "<p>Amitabh Bachchan[a] (né Srivastava; 11 October 1942) is an Indian actor who works in Hindi cinema. He is often considered one of the greatest, most accomplished and commercially successful actors in the history of Indian cinema With a cinematic career spanning over five decades, he has played in over 200 films. Bachchan is often hailed as the Shahenshah of Bollywood, Sadi Ke Mahanayak (translated as \"Greatest actor of the century\" in Hindi), Star of the Millennium, or simply Big B His dominance in the Indian film industry during the 1970s–80s led the French director François Truffaut to describe it as a \"one-man industry\". He is a recipient of several accolades including six National Film Awards and sixteen Filmfare Awards.</p><p>Amitabh Bachchan was born in 1942 in Allahabad (now Prayagraj) to the Hindi poet Harivansh Rai Bachchan and his wife, the social activist Teji Bachchan. He was educated at Sherwood College, Nainital, and Kirori Mal College, University of Delhi. His film career started in 1969 as a voice narrator in Mrinal Sen's film Bhuvan Shome. He first gained popularity in the early-1970s for films, such as Anand, Zanjeer and Roti Kapada Aur Makaan, and achieved greater stardom in later years, being dubbed India's \"Angry Young Man\" for several of his on-screen roles in Hindi films. Bachchan has won numerous accolades in his career, including record four National Film Awards in Best Actor category and many awards at international film festivals and award ceremonies. He has won sixteen Filmfare Awards and is the most nominated performer in any major acting category at Filmfare with 34 nominations in Best Actor and 42 nominations overall. The Government of India honoured him with the Padma Shri in 1984, the Padma Bhushan in 2001, the Padma Vibhushan in 2015, and India's highest award in the field of cinema, the Dadasaheb Phalke Award in 2018 for his contributions to the arts. The Government of France honoured him with its highest civilian honour, Officer of the Legion of Honour, in 2007 for his exceptional career in the world of cinema and beyond.</p><p>In addition to acting, Bachchan has worked as a playback singer, film producer, and television presenter. He has hosted several seasons of the game show Kaun Banega Crorepati, India's version of the game show franchise, Who Wants to Be a Millionaire?. He also entered politics for a time in the 1980s. Bachchan has also been involved in several humanitarian works and he is a leading brand endorser in India. Beyond the Indian subcontinent, he acquired a large overseas following of the South Asian diaspora, as well as others, in markets including Africa (South Africa, Eastern Africa, and Mauritius), the Middle East (especially Egypt and the UAE), the United Kingdom, Russia, Central Asia, the Caribbean (Guyana, Suriname, and Trinidad and Tobago), Oceania (Fiji, Australia, and New Zealand), Canada and the United States. Bachchan was voted the \"greatest star of stage or screen\" in the BBC Your Millennium online poll in 1999. In October 2003, Time magazine dubbed Bachchan the \"Star of the Millennium\".</p>",
        "related": ["abhishek-bachchan", "aishwarya-rai"]
    },
    "response": {
        "ascendant": {
            "asc_deg": 313.9998116258755,
            "ascendant": 11
        },
        "planets": {
            "Jupiter": {
                "degree": 90.5399095810177,
                "cusp_degree": 0.5399095810176959,
                "motion_speed": 0.09831515692583234,
                "zodiac": 4,
                "house": 6,
                "motion": "D"
            },
            "Sun": {
                "degree": 174.40700400012955,
                "cusp_degree": 24.407004000129547,
                "motion_speed": 0.9894992796989762,
                "zodiac": 6,
                "house": 8,
                "motion": "D"
            },
            "Moon": {
                "degree": 190.68513227013304,
                "cusp_degree": 10.685132270133039,
                "motion_speed": 14.160750157165165,
                "zodiac": 7,
                "house": 9,
                "motion": "D"
            },
            "Venus": {
                "degree": 165.2219771611035,
                "cusp_degree": 15.221977161103496,
                "motion_speed": 1.2492946936967664,
                "zodiac": 6,
                "house": 8,
                "motion": "D"
            },
            "Mars": {
                "degree": 172.62060169968893,
                "cusp_degree": 22.620601699688933,
                "motion_speed": 0.6596830134447863,
                "zodiac": 6,
                "house": 8,
                "motion": "D"
            },
            "Mercury": {
                "degree": 173.626433674216,
                "cusp_degree": 23.626433674216003,
                "motion_speed": -1.1825367130619089,
                "zodiac": 6,
                "house": 8,
                "motion": "R"
            },
            "Saturn": {
                "degree": 49.23057020983117,
                "cusp_degree": 19.23057020983117,
                "motion_speed": -0.029202757678467445,
                "zodiac": 2,
                "house": 4,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 130.4165732076472,
                "cusp_degree": 10.41657320764719,
                "motion_speed": -0.12035716749351563,
                "zodiac": 5,
                "house": 7,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 128.7781898088889,
                "cusp_degree": 8.778189808888897,
                "motion_speed": -0.05299212598743668,
                "zodiac": 5,
                "house": 7,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 308.7781898088889,
                "motion_speed": -0.05299212598743668,
                "cusp_degree": 8.778189808888897,
                "zodiac": 11,
                "house": 1,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 310.41657320764716,
                "motion_speed": -0.12035716749351563,
                "cusp_degree": 10.416573207647161,
                "zodiac": 11,
                "house": 1,
                "motion": "R"
            }
        }
    }
}
