{
    "request": {
        "name": "Arvind Kejariwal",
        "title": "Politician, Chief Minister",
        "year": 1968,
        "month": 8,
        "day": 16,
        "hour": 7,
        "minute": 30,
        "second": 0,
        "latitude": 28.7931703,
        "longitude": 76.1391283,
        "location": "Bhiwani, Haryana",
        "agyat_rating": "AA",
        "gender": "male",
        "advanced": "fame, legal-troubles, detention",
        "about": "<p>Arvind Kejriwal (Hindi pronunciation: [əɾʋin̪d̪ ked͡ʒɾiːʋaːl]; born 16 August 1968) is an Indian politician, activist and former bureaucrat, who served as the 7th Chief Minister of Delhi. He was the chief minister from 2013 to 2014 and from 2015 to 2024. He is also the national convener of the Aam Aadmi Party (AAP) since 2012. He represented the New Delhi constituency in the Delhi Legislative Assembly from 2015 to 2025, and previously from 2013 to 2014.</p><p>In 2006, Kejriwal was awarded the Ramon Magsaysay Award for his involvement in the Parivartan movement using right to information legislation in a campaign against government corruption. The same year, after resigning from government service, he founded the Public Cause Research Foundation to campaign for transparent governance. Before entering politics, Kejriwal had worked in the Indian Revenue Service. Prior to that, he was a mechanical engineer from IIT Kharagpur.</p><p>In 2012, he launched the AAP. In 2013, he assumed office as the Chief Minister of Delhi and resigned 49 days later over his inability to mobilise support for his proposed anti-corruption legislation. In the 2015 Delhi Legislative Assembly elections, the AAP registered an unprecedented majority. In subsequent 2020 elections, AAP re-emerged victorious and retained power in Delhi, following which, Kejriwal was sworn in as the Chief Minister of Delhi for the third time in a row. Outside Delhi, his party registered another major victory in 2022 Punjab Legislative Assembly election.</p><p>He was arrested on 21 March 2024 by the Enforcement Directorate on allegations of a liquor scam against the Aam Aadmi Party led Delhi Government. He became the first ever sitting chief minister in India to be arrested. His other party leaders, Satyendra Jain, Sanjay Singh and Manish Sisodia have also spent months to years in jail without bail, trial or conviction. The opposition alliance called the arrest weeks before the 2024 Indian general election, a case of fabrication and \"match-fixing\" by the BJP. Amnesty International said that financial and terrorism laws have been weaponised to go after political opponents. On 10 May, the Supreme Court ordered Kejriwal's release on interim bail until 1 June 2024, on account of campaigning for the election. Kejriwal surrendered at Tihar Jail after the expiry of his bail period on 2 June 2024. On 13 September 2024, he was granted bail by Supreme Court with certain conditions, the case still continues. On 17 September 2024, he resigned as Delhi Chief Minister saying he will only become CM again if he receives a public mandate.</p><p>His party was defeated in the 2025 Delhi Legislative Assembly election, losing his seat to Parvesh Verma by a margin of over 4,000 votes from the New Delhi Assembly constituency.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 134.5767131857973,
            "ascendant": 5
        },
        "planets": {
            "Sun": {
                "degree": 119.82472810445661,
                "cusp_degree": 29.82472810445661,
                "motion_speed": 0.9612496085511368,
                "zodiac": 4,
                "house": 12,
                "motion": "D"
            },
            "Moon": {
                "degree": 29.550176375696434,
                "cusp_degree": 29.550176375696434,
                "motion_speed": 11.868734490439378,
                "zodiac": 1,
                "house": 9,
                "motion": "D"
            },
            "Mercury": {
                "degree": 128.52857861671765,
                "cusp_degree": 8.528578616717652,
                "motion_speed": 1.8771965152400694,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Venus": {
                "degree": 135.39585818572797,
                "cusp_degree": 15.395858185727974,
                "motion_speed": 1.2312882791795867,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Mars": {
                "degree": 103.25958807513757,
                "cusp_degree": 13.259588075137572,
                "motion_speed": 0.6427242531613315,
                "zodiac": 4,
                "house": 12,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 137.82508261813516,
                "cusp_degree": 17.825082618135156,
                "motion_speed": 0.21079366325920504,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Saturn": {
                "degree": 2.0645378995934487,
                "cusp_degree": 2.0645378995934487,
                "motion_speed": -0.015516387622187357,
                "zodiac": 1,
                "house": 9,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 347.35194861632567,
                "cusp_degree": 17.35194861632567,
                "motion_speed": 0.0007038420271742397,
                "zodiac": 12,
                "house": 8,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 348.49898555895044,
                "cusp_degree": 18.498985558950437,
                "motion_speed": -0.05299203479622376,
                "zodiac": 12,
                "house": 8,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 168.49898555895038,
                "motion_speed": -0.05299203479622376,
                "cusp_degree": 18.49898555895038,
                "zodiac": 6,
                "house": 2,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 167.35194861632567,
                "motion_speed": 0.0007038420271742397,
                "cusp_degree": 17.35194861632567,
                "zodiac": 6,
                "house": 2,
                "motion": "R"
            }
        }
    }
}
