{
    "request": {
        "name": "Shri Atal Bihari Vajpayee",
        "title": "Politician, Prime Minister",
        "year": 1924,
        "month": 12,
        "day": 25,
        "hour": 5,
        "minute": 45,
        "second": 0,
        "latitude": 26.2037247,
        "longitude": 78.1573628,
        "location": "Gwalior, Madhya Pradesh",
        "agyat_rating": "AA",
        "gender": "male",
        "about": "<p>Atal Bihari Vajpayee (25 December 1924 – 16 August 2018) was an Indian poet, writer and statesman who served as the prime minister of India, first for a term of 13 days in 1996, then for a period of 13 months from 1998 to 1999, followed by a full term from 1999 to 2004. He was the first non-Congress prime minister to serve a full term in the office. Vajpayee was one of the co-founders and a senior leader of the Bharatiya Janata Party (BJP). He was a member of the Rashtriya Swayamsevak Sangh (RSS), a far-right Hindu nationalist paramilitary volunteer organisation. He was also a Hindi poet and a writer.</p><p>He was a member of the Indian Parliament for over five decades, having been elected ten times to the Lok Sabha, the lower house, and twice to the Rajya Sabha, the upper house. He served as the Member of Parliament from Lucknow, Gwalior, New Delhi and Balrampur constituencies, before retiring from active politics in 2009 due to health concerns. He was among the founding members of the Bharatiya Jana Sangh (BJS), of which he was president from 1968 to 1972. The BJS merged with several other parties to form the Janata Party, which won the 1977 general election. In March 1977, Vajpayee became the minister of external affairs in the cabinet of Prime Minister Morarji Desai. He resigned in 1979, and the Janata alliance collapsed soon after. Former members of the Bharatiya Jana Sangh formed the BJP in 1980, with Vajpayee as its first president.</p><p>During his tenure as prime minister, India carried out the Pokhran-II nuclear tests in 1998. Vajpayee sought to improve diplomatic relations with Pakistan, travelling to Lahore by bus to meet with Prime Minister, Nawaz Sharif. After the 1999 Kargil War with Pakistan, he sought to restore relations through engagement with President Pervez Musharraf, inviting him to India for a summit at Agra. Vajpayee's government introduced many domestic economic and infrastructural reforms, including encouraging the private sector and foreign investments, reducing governmental waste, encouraging research and development, and the privatisation of some government owned corporations. During his tenure, India's security was threatened by a number of violent incidents including 2001 Indian Parliament attack and 2002 Gujarat riots which ultimately caused his defeat in 2004 general election.</p><p>Vajpayee was conferred with the Padma Vibhushan in 1992, India's second highest civilian award by the Government of India. The administration of Narendra Modi declared in 2014 that Vajpayee's birthday, 25 December would be marked as Good Governance Day. In 2015, he was honoured India's highest civilian honour - Bharat Ratna, by the then President of India, Pranab Mukherjee. He died in 2018 due to age-related illness.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 226.8252520741001,
            "ascendant": 8
        },
        "planets": {
            "Sun": {
                "degree": 250.12907582427917,
                "cusp_degree": 10.12907582427917,
                "motion_speed": 1.0194131430174695,
                "zodiac": 9,
                "house": 2,
                "motion": "D"
            },
            "Moon": {
                "degree": 233.53816928690037,
                "cusp_degree": 23.53816928690037,
                "motion_speed": 15.240567236726964,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Mercury": {
                "degree": 255.71634036900852,
                "cusp_degree": 15.71634036900852,
                "motion_speed": -1.225657465849435,
                "zodiac": 9,
                "house": 2,
                "motion": "R"
            },
            "Venus": {
                "degree": 221.1220937792031,
                "cusp_degree": 11.122093779203112,
                "motion_speed": 1.2420335596736591,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Mars": {
                "degree": 340.5251732877869,
                "cusp_degree": 10.525173287786913,
                "motion_speed": 0.6069802614434358,
                "zodiac": 12,
                "house": 5,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 248.73707224971173,
                "cusp_degree": 8.73707224971173,
                "motion_speed": 0.22956585495412477,
                "zodiac": 9,
                "house": 2,
                "motion": "D"
            },
            "Saturn": {
                "degree": 198.65715062003784,
                "cusp_degree": 18.65715062003784,
                "motion_speed": 0.08963613304666262,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 111.60806092963875,
                "cusp_degree": 21.608060929638754,
                "motion_speed": -0.10874515504316233,
                "zodiac": 4,
                "house": 9,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 113.19633341128295,
                "cusp_degree": 23.19633341128295,
                "motion_speed": -0.05299201073519373,
                "zodiac": 4,
                "house": 9,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 293.1963334112829,
                "motion_speed": -0.05299201073519373,
                "cusp_degree": 23.19633341128292,
                "zodiac": 10,
                "house": 3,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 291.6080609296388,
                "motion_speed": -0.10874515504316233,
                "cusp_degree": 21.608060929638782,
                "zodiac": 10,
                "house": 3,
                "motion": "R"
            }
        }
    }
}
