{
    "request": {
        "name": "Benjamin Netanyahu",
        "title": "Politician, Prime Minister",
        "year": 1949,
        "month": 10,
        "day": 21,
        "hour": 11,
        "minute": 30,
        "second": 0,
        "latitude": 32.0852997,
        "longitude": 34.7818064,
        "location": "Tel Aviv, Israel",
        "agyat_rating": "AA",
        "gender": "male",
        "about": "<p>Benjamin Netanyahu[a] (born 21 October 1949) is an Israeli politician who has served as the prime minister of Israel since 2022, having previously held the office from 1996 to 1999 and from 2009 to 2021. Netanyahu is the longest-serving prime minister in Israel's history, having served a total of over 17 years.</p><p>Born to secular Jewish parents, Netanyahu was raised in West Jerusalem and the United States. He returned to Israel in 1967 to join the Israel Defense Forces and served in the Sayeret Matkal special forces as a captain before being honorably discharged. In 1972, he returned to the United States, and after graduating from the Massachusetts Institute of Technology, Netanyahu worked for the Boston Consulting Group before moving back to Israel in 1978 to found the Yonatan Netanyahu Anti-Terror Institute. Between 1984 and 1988 Netanyahu was Israel's ambassador to the United Nations. Netanyahu rose to prominence after election as chair of Likud in 1993, becoming leader of the opposition. In the 1996 general election, Netanyahu became the first Israeli prime minister elected directly by popular vote, and its youngest. Netanyahu was defeated in the 1999 election and retired from politics, entering the private sector. He returned and served as minister of foreign affairs and finance, initiating economic reforms, before resigning over the Gaza disengagement plan.</p><p>Netanyahu returned to lead Likud in 2005 and was leader of the opposition between 2006 and 2009. After the 2009 legislative election, Netanyahu formed a coalition with other right-wing parties and became prime minister again. He led Likud to victory in the 2013 and 2015 elections. Netanyahu made his closeness to Donald Trump, a friend since the 1980s, central to his appeal from 2016. During Trump's first presidency, the US recognized Jerusalem as capital of Israel, Israeli sovereignty over the Golan Heights, and brokered the Abraham Accords, normalization agreements between Israel and the Arab world. Netanyahu has faced criticism over expanding Israeli settlements in the occupied West Bank, deemed illegal under international law. In 2019, Netanyahu was indicted on charges of breach of trust, bribery and fraud, and relinquished all ministerial posts except prime minister. The 2018–2022 Israeli political crisis led to a rotation agreement between Netanyahu and Benny Gantz. This collapsed in 2020, leading to a March 2021 election. In June 2021, Netanyahu was removed from the premiership, before returning after the 2022 election.</p><p>Netanyahu's premierships have been marked by democratic backsliding and a shift towards an authoritarian style of government. Netanyahu's coalition pursued judicial reform, which was met with large-scale protests in early 2023. The 7 October attacks by Hamas-led Palestinian groups in the same year triggered the Gaza war, with Netanyahu facing nationwide protests for the security lapse during the attack and failure to secure the return of Israeli hostages. In October 2024, he also ordered an invasion of Lebanon with the stated goal of destroying the military capabilities of Hezbollah, a key ally of Hamas that helped them since the 7 October attack. After the fall of the Assad regime in December 2024, Netanyahu directed an invasion of Syria against the Syrian opposition. Netanyahu's government has been accused of genocide in Gaza, culminating in the South Africa v. Israel case before the International Court of Justice in December 2023. The International Criminal Court issued an arrest warrant in November 2024 for Netanyahu along with former defense minister Yoav Gallant and Hamas militant Mohammed Deif, for alleged war crimes and crimes against humanity as part of the ICC investigation in Palestine.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 252.30154785135022,
            "ascendant": 9
        },
        "planets": {
            "Jupiter": {
                "degree": 270.8602144002877,
                "cusp_degree": 0.8602144002877026,
                "motion_speed": 0.09998190660891391,
                "zodiac": 10,
                "house": 2,
                "motion": "D"
            },
            "Sun": {
                "degree": 184.48472804130748,
                "cusp_degree": 4.484728041307477,
                "motion_speed": 0.9953124411045928,
                "zodiac": 7,
                "house": 11,
                "motion": "D"
            },
            "Moon": {
                "degree": 177.2428516723539,
                "cusp_degree": 27.242851672353908,
                "motion_speed": 15.209893970289684,
                "zodiac": 6,
                "house": 10,
                "motion": "D"
            },
            "Venus": {
                "degree": 229.323837113325,
                "cusp_degree": 19.323837113325,
                "motion_speed": 1.1286218801846648,
                "zodiac": 8,
                "house": 12,
                "motion": "D"
            },
            "Mars": {
                "degree": 123.6041939441008,
                "cusp_degree": 3.6041939441007997,
                "motion_speed": 0.5772774329803717,
                "zodiac": 5,
                "house": 9,
                "motion": "D"
            },
            "Mercury": {
                "degree": 166.57087815747897,
                "cusp_degree": 16.570878157478973,
                "motion_speed": 1.2053316519999446,
                "zodiac": 6,
                "house": 10,
                "motion": "D"
            },
            "Saturn": {
                "degree": 142.24280617789043,
                "cusp_degree": 22.24280617789043,
                "motion_speed": 0.10424387476436278,
                "zodiac": 5,
                "house": 9,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 353.52957981349704,
                "cusp_degree": 23.529579813497037,
                "motion_speed": -0.0023915522380621628,
                "zodiac": 12,
                "house": 4,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 352.74969500363693,
                "cusp_degree": 22.74969500363693,
                "motion_speed": -0.05299205297095804,
                "zodiac": 12,
                "house": 4,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 172.74969500363693,
                "motion_speed": -0.05299205297095804,
                "cusp_degree": 22.74969500363693,
                "zodiac": 6,
                "house": 10,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 173.5295798134971,
                "motion_speed": -0.0023915522380621628,
                "cusp_degree": 23.529579813497094,
                "zodiac": 6,
                "house": 10,
                "motion": "R"
            }
        }
    }
}
