{
    "request": {
        "name": "Billie Eilish",
        "title": "Singer, Songwriter",
        "year": 2001,
        "month": 12,
        "day": 18,
        "hour": 12,
        "minute": 17,
        "second": 0,
        "latitude": 34.05223,
        "longitude": -118.24368,
        "location": "Los Angeles",
        "agyat_rating": "AA",
        "gender": "female",
        "about": "<p>American singer and songwriter who first gained public attention in 2015 with her debut single \"Ocean Eyes\", written and produced by her brother Finneas O'Connell, with whom she collaborates on music and live shows. In 2017, she released her debut extended play (EP) Don't Smile at Me. Commercially successful, it reached the top 15 of record charts in numerous countries, including the US, UK, Canada, and Australia.</p><p>Eilish's first studio album When We All Fall Asleep, Where Do We Go? (2019), debuted atop the US Billboard 200 and UK Albums Chart. It was one of the year's best-selling albums, buoyed by the success of its fifth single, \"Bad Guy\", Eilish's first number-one on the US Billboard Hot 100. This made her the first artist born in the 21st century to release a chart-topping single. The next year, Eilish performed the theme song \"No Time to Die\" for the James Bond film of the same name, which topped the UK Singles Chart and won the Academy Award for Best Original Song in 2022. Her subsequent singles \"Everything I Wanted\", \"My Future\", \"Therefore I Am\", and \"Your Power\" peaked in the top 10 in the US and UK. Her second studio album Happier Than Ever (2021) topped the charts in 25 countries. She wrote and performed \"What Was I Made For?\" from the fantasy film Barbie (2023), which became her second number-one single in the UK and earned her a second Academy Award nomination.</p><p>She is the youngest person and first female to win the four main Grammy categories, Album of the Year, Record of the Year, Song of the Year, and Best New Artist in the same year.</p><p>She is the daughter of actress and screenwriter Maggie Baird and actor Patrick O'Connell, both of whom are also musicians. Eilish is of Irish and Scottish descent.</p><p>Eilish and her musician brother Finneas frequently collaborate on her music. In an interview published by The Guardian in March 2019, Eilish stated she has never used drugs or smoked. Eilish stated that she has Tourette syndrome, synesthesia, and has experienced depression. She was raised vegetarian and regularly advocates for veganism on social media. Eilish has also shared that she experienced sexual abuse as a child.</p><p>Eilish previously dated rapper Brandon Adams, who goes by the stage name 7:AMP. She dated singer Jesse Rutherford from October 2022 to May 2023. She has said that she is attracted to both men and women.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 339.2422596409222,
            "ascendant": 12
        },
        "planets": {
            "Jupiter": {
                "degree": 78.5307636883912,
                "cusp_degree": 18.530763688391204,
                "motion_speed": -0.12676122767735004,
                "zodiac": 3,
                "house": 4,
                "motion": "R"
            },
            "Sun": {
                "degree": 243.10021379992287,
                "cusp_degree": 3.1002137999228694,
                "motion_speed": 1.0181815955867815,
                "zodiac": 9,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 289.1072727168249,
                "cusp_degree": 19.107272716824923,
                "motion_speed": 12.130409881000146,
                "zodiac": 10,
                "house": 11,
                "motion": "D"
            },
            "Venus": {
                "degree": 236.72138770101242,
                "cusp_degree": 26.721387701012418,
                "motion_speed": 1.2585893133697905,
                "zodiac": 8,
                "house": 9,
                "motion": "D"
            },
            "Mars": {
                "degree": 313.36903702048954,
                "cusp_degree": 13.369037020489543,
                "motion_speed": 0.7314530302497722,
                "zodiac": 11,
                "house": 12,
                "motion": "D"
            },
            "Mercury": {
                "degree": 250.886644621872,
                "cusp_degree": 10.886644621871994,
                "motion_speed": 1.5854098076405827,
                "zodiac": 9,
                "house": 10,
                "motion": "D"
            },
            "Saturn": {
                "degree": 46.375285774315316,
                "cusp_degree": 16.375285774315316,
                "motion_speed": -0.07674521253763648,
                "zodiac": 2,
                "house": 3,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 63.269676242662044,
                "cusp_degree": 3.269676242662044,
                "motion_speed": 0.00033059024536334457,
                "zodiac": 3,
                "house": 4,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 63.17408060767404,
                "cusp_degree": 3.1740806076740427,
                "motion_speed": -0.05299202134634868,
                "zodiac": 3,
                "house": 4,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 243.17408060767406,
                "motion_speed": -0.05299202134634868,
                "cusp_degree": 3.174080607674057,
                "zodiac": 9,
                "house": 10,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 243.26967624266206,
                "motion_speed": 0.00033059024536334457,
                "cusp_degree": 3.269676242662058,
                "zodiac": 9,
                "house": 10,
                "motion": "R"
            }
        }
    }
}
