{
    "request": {
        "name": "Bipin Rawat",
        "title": "Army Chief",
        "year": 1958,
        "month": 3,
        "day": 16,
        "hour": 12,
        "minute": 0,
        "second": 0,
        "latitude": 30.15286,
        "longitude": 78.7771,
        "location": "Pauri Garhwal",
        "agyat_rating": "AX",
        "advanced": "accident, air-crash",
        "about": "<p>Bipin Rawat (16 March 1958 – 8 December 2021) was an Indian military officer who was a four-star general of the Indian Army. He served as the first Chief of Defence Staff (CDS) of the Indian Armed Forces from January 2020 until his death in a helicopter crash in December 2021. Prior to taking over as the CDS, he served as the 57th Chairman of the Chiefs of Staff Committee (Chairman COSC) of the Indian Armed Forces as well as 27th Chief of the Army Staff (COAS) of the Indian Army.</p><p>Born in Pauri, Pauri Garhwal district in present-day Uttarakhand to Lieutenant General Lakshman Singh Rawat, he graduated from the National Defence Academy and the Indian Military Academy where he was awarded the Sword of Honour. He was commissioned into his father's unit - 11 Gorkha Rifles. He served during the 1987 Sino-Indian skirmish in the Sumdorong Chu valley. He commanded a company in Uri and his battalion - 5/11 GR along the Line of Actual Control in Arunachal Pradesh. Promoted to the rank of Brigadier, he commanded 5 sector Rashtriya Rifles in Sopore. He subsequently served with the United Nations as the Commander of a Multinational Brigade as part of MONUSCO.</p><p>Promoted to general officer, Rawat commanded the 19 Infantry Division at Uri. He then served as the Major General General Staff (MGGS) at Headquarters Eastern Command. In 2014, he was promoted to the rank of Lieutenant General and appointed General officer commanding (GOC) III Corps at Dimapur. During this tenure, the 2015 Indian counter-insurgency operation in Myanmar took place where units under his command executed cross-border strikes against the NSCN-K. In early 2016, Rawat was promoted to Army Commander grade and appointed General Officer Commanding-in-Chief Southern Command. After a short stint, he moved to Army HQ as the Vice Chief of the Army Staff. In December that year, he was appointed the next Chief of the Army Staff superseding two senior generals. As the senior-most chief of staff amongst the three services, he served as the Chairman of the Chiefs of Staff Committee of the Indian Armed Forces from September 2019 to December 2021. He was appointed as the first Chief of Defence Staff (CDS) of the Indian Armed Forces in January 2020 and served until his death in December 2021.</p><p>During Rawat's tenure as the COAS, in 2017, a 73-day military border standoff happened at Doklam between the Indian Armed Forces and the People's Liberation Army.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 65.41759355175108,
            "ascendant": 3
        },
        "planets": {
            "Jupiter": {
                "degree": 187.1331019516328,
                "cusp_degree": 7.133101951632796,
                "motion_speed": -0.0845317542008801,
                "zodiac": 7,
                "house": 5,
                "motion": "R"
            },
            "Sun": {
                "degree": 331.8758722536733,
                "cusp_degree": 1.8758722536733217,
                "motion_speed": 0.9959699118112125,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 286.2822014496373,
                "cusp_degree": 16.282201449637284,
                "motion_speed": 12.22186237743138,
                "zodiac": 10,
                "house": 8,
                "motion": "D"
            },
            "Venus": {
                "degree": 288.2646424195918,
                "cusp_degree": 18.26464241959178,
                "motion_speed": 0.7279145184808313,
                "zodiac": 10,
                "house": 8,
                "motion": "D"
            },
            "Mars": {
                "degree": 275.96083832152965,
                "cusp_degree": 5.96083832152965,
                "motion_speed": 0.7308109521071938,
                "zodiac": 10,
                "house": 8,
                "motion": "D"
            },
            "Mercury": {
                "degree": 343.54942959909437,
                "cusp_degree": 13.549429599094367,
                "motion_speed": 1.9035012181676594,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Saturn": {
                "degree": 242.11582062810663,
                "cusp_degree": 2.1158206281066327,
                "motion_speed": 0.03218939084680212,
                "zodiac": 9,
                "house": 7,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 188.62681702515664,
                "cusp_degree": 8.62681702515664,
                "motion_speed": -0.10070828183403642,
                "zodiac": 7,
                "house": 5,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 190.17676227725985,
                "cusp_degree": 10.176762277259854,
                "motion_speed": -0.052992144283112864,
                "zodiac": 7,
                "house": 5,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 10.176762277259854,
                "motion_speed": -0.052992144283112864,
                "cusp_degree": 10.176762277259854,
                "zodiac": 1,
                "house": 11,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 8.62681702515664,
                "motion_speed": -0.10070828183403642,
                "cusp_degree": 8.62681702515664,
                "zodiac": 1,
                "house": 11,
                "motion": "R"
            }
        }
    }
}
