{
    "request": {
        "name": "Bruce Lee",
        "title": "Martial Artist, Actor, Producer, Screen Writer, Director",
        "year": 1940,
        "month": 11,
        "day": 27,
        "hour": 7,
        "minute": 12,
        "second": 0,
        "latitude": 37.77493,
        "longitude": -122.41942,
        "location": "San Francisco",
        "agyat_rating": "AA",
        "gender": "male",
        "about": "<p>Bruce Lee (born Lee Jun-fan; November 27, 1940 – July 20, 1973) was a Hong Kong-American martial artist, actor, filmmaker, and philosopher. He was the founder of Jeet Kune Do, a hybrid martial arts philosophy which was formed from Lee's experiences in unarmed fighting and self-defense—as well as eclectic, Zen Buddhist and Taoist philosophies—as a new school of martial arts thought. With a film career spanning Hong Kong and the United States, Lee is regarded as the first global Chinese film star and one of the most influential martial artists in the history of cinema. Known for his roles in five feature-length martial arts films, Lee is credited with helping to popularize martial arts films in the 1970s and promoting Hong Kong action cinema.</p><p>Born in San Francisco and raised in British Hong Kong, Lee was introduced to the Hong Kong film industry as a child actor by his father. His early martial arts experience included Wing Chun (trained under Ip Man), tai chi, boxing (winning a Hong Kong boxing tournament), and frequent street fighting (neighborhood and rooftop fights). In 1959, Lee moved to Seattle, where he enrolled at the University of Washington in 1961. It was during this time in the United States that he began considering making money by teaching martial arts, even though he aspired to have a career in acting. He opened his first martial arts school, operated out of his home in Seattle. After later adding a second school in Oakland, California, he once drew significant attention at the 1964 Long Beach International Karate Championships of California by making demonstrations and speaking. He subsequently moved to Los Angeles to teach, where his students included Chuck Norris, Sharon Tate, and Kareem Abdul-Jabbar.</p><p>His roles in America, including playing Kato in The Green Hornet introduced him to American audiences. After returning to Hong Kong in 1971, Lee landed his first leading role in The Big Boss, directed by Lo Wei. A year later he starred in Fist of Fury, in which he portrayed Chen Zhen, and The Way of the Dragon, directed and written by Lee. He went on to star in the US-Hong Kong co-production Enter the Dragon (1973) and The Game of Death (1978). His Hong Kong and Hollywood-produced films, all of which were commercially successful, elevated Hong Kong martial arts films to a new level of popularity and acclaim, sparking a surge of Western interest in Chinese martial arts. The direction and tone of his films, including their fight choreography and diversification, dramatically influenced and changed martial arts and martial arts films worldwide. With his influence, kung fu films began to displace the wuxia film genre—fights were choreographed more realistically, fantasy elements were discarded for real-world conflicts, and the characterisation of the male lead went from simply being a chivalrous hero to one that embodied the notion of masculinity.</p><p>Lee's career was cut short by his sudden death at age 32 from a brain edema, the causes of which remain a matter of dispute. Nevertheless, his films remained popular, gained a large cult following, and became widely imitated and exploited. He became an iconic figure known throughout the world, particularly among the Chinese, based upon his portrayal of Cantonese culture in his films, and among Asian Americans for defying Asian stereotypes in the United States. Since his death, Lee has continued to be a prominent influence on modern combat sports, including judo, karate, mixed martial arts, and boxing, as well as modern popular culture, including film, television, comics, animation, and video games. Time named Lee one of the 100 most important people of the 20th century.</p>",
        "advanced": "death by illness, cerebral edema"
    },
    "response": {
        "ascendant": {
            "asc_deg": 221.81945772680558,
            "ascendant": 8
        },
        "planets": {
            "Jupiter": {
                "degree": 14.505736340511165,
                "cusp_degree": 14.505736340511165,
                "motion_speed": -0.10536342272477435,
                "zodiac": 1,
                "house": 6,
                "motion": "R"
            },
            "Sun": {
                "degree": 222.20804850340957,
                "cusp_degree": 12.208048503409572,
                "motion_speed": 1.0130620390427458,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Moon": {
                "degree": 198.29954315963272,
                "cusp_degree": 18.29954315963272,
                "motion_speed": 14.845567964428291,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Venus": {
                "degree": 188.3249716150339,
                "cusp_degree": 8.324971615033888,
                "motion_speed": 1.2267488330781524,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Mars": {
                "degree": 191.5203819082862,
                "cusp_degree": 11.520381908286197,
                "motion_speed": 0.6600379584322007,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Mercury": {
                "degree": 202.2346481582811,
                "cusp_degree": 22.23464815828109,
                "motion_speed": 0.8974234293712078,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Saturn": {
                "degree": 16.453906855687656,
                "cusp_degree": 16.453906855687656,
                "motion_speed": -0.06823799361760277,
                "zodiac": 1,
                "house": 6,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 166.61796435569912,
                "cusp_degree": 16.617964355699115,
                "motion_speed": -0.08132099776991784,
                "zodiac": 6,
                "house": 11,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 164.9608065162407,
                "cusp_degree": 14.960806516240694,
                "motion_speed": -0.05299209467992036,
                "zodiac": 6,
                "house": 11,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 344.9608065162407,
                "motion_speed": -0.05299209467992036,
                "cusp_degree": 14.960806516240723,
                "zodiac": 12,
                "house": 5,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 346.6179643556991,
                "motion_speed": -0.08132099776991784,
                "cusp_degree": 16.617964355699087,
                "zodiac": 12,
                "house": 5,
                "motion": "R"
            }
        }
    }
}
