{
    "request": {
        "name": "Chiranjeevi",
        "title": "Actor, Politician",
        "year": 1955,
        "month": 8,
        "day": 22,
        "hour": 10,
        "minute": 10,
        "second": 0,
        "latitude": 16.4167,
        "longitude": 81.6,
        "location": "Mogalthuru",
        "agyat_rating": "AA",
        "about": "<p>Konidela Chiranjeevi (born Konidela Sivasankara Varaprasad; 22 August 1955) is an Indian actor, philanthropist and former politician known for his work in Telugu cinema. Known as the \"Mega Star\", he is widely regarded as one of the most successful and influential actors in the history of Indian cinema. Chiranjeevi holds the record for the most \"Industry Hits\" in Telugu cinema, with eight films emerging as the top-grossers of their time—a feat unmatched by any actor in the industry's 100-year history. He is also celebrated as one of the finest dancers in Indian cinema. He has received numerous honours, including the Padma Bhushan in 2006 and the Padma Vibhushan in 2024 from the Government of India, as well as the IFFI Indian Film Personality of the Year Award in 2022. His other accolades include the Raghupathi Venkaiah Award, three Nandi Awards, and nine Filmfare Awards South, including the Lifetime Achievement Award. In 2013, CNN-IBN recognized him as one of \"the men who changed the face of the Indian Cinema\". In 2024, he was honoured with a Guinness World Record as the most prolific actor-dancer in the Indian film industry.</p><p>Chiranjeevi made his acting debut in 1978, initially gaining recognition for his supporting, anti-hero, and antagonist roles. He later transitioned to lead roles with notable success. His breakthrough came with the 1983 film Khaidi, which became the highest-grossing Telugu film at the time and established him as a leading actor in the industry. Throughout the 1980s and early 1990s, Chiranjeevi starred in various \"Industry Hits\"—highest-grossers of all time—like Pasivadi Pranam (1987), Yamudiki Mogudu (1988), Attaku Yamudu Ammayiki Mogudu (1989), Jagadeka Veerudu Athiloka Sundari (1990), Gang Leader (1991), and Gharana Mogudu (1992). Notably, Gharana Mogudu was the first South Indian film to earn over ₹10 crore in distributor share, prompting The Week magazine to label him \"Bigger than Bachchan\" and \"the new money machine.\"</p><p>For his role in Aapadbandhavudu (1992), Chiranjeevi was paid ₹1.25 crore, making him the highest-paid actor in India at the time and the first Indian actor to command a ₹1 crore remuneration for a film. During this period, he received widespread critical acclaim for his performances in Swayamkrushi (1987), Rudraveena (1988), and Aapadbandhavudu (1992), showcasing his versatility as an actor who excelled in both commercial blockbusters and critically acclaimed films. Notably, Swayamkrushi was screened at the Moscow International Film Festival, while Rudraveena, which he co-produced, won the National Film Award for Best Feature Film on National Integration. In the late 1990s and early 2000s, Chiranjeevi continued to dominate the box office with films like Master (1997), and Choodalani Vundi (1998). His 2002 film Indra was the highest-grossing Telugu film for many years, and socially impactful films like Tagore (2003) and Shankar Dada M.B.B.S. (2004) became major blockbusters, further cementing his legacy.</p><p>On 2 October 1998, Chiranjeevi established the Chiranjeevi Charitable Trust, which operates the largest blood and eye banks in the Telugu states. The trust has restored eyesight to over 9,000 individuals through cornea transplants and provides 70% of collected blood free to the poor. It has received several accolades, including the \"Best Voluntary Blood Bank Award\" from the Government of Andhra Pradesh for five consecutive years from 2002 to 2006. In 2002, he was honoured with the Samman Award by the Income Tax Department, for being the highest income tax payer in the profession category for the assessment year 1999–2000.</p><p>In 2008, Chiranjeevi founded the Praja Rajyam Party and led it in the 2009 Andhra Pradesh elections, where it won 18 seats and secured over 16% of the vote, making it the third-largest party in the state. The party merged with the Indian National Congress in 2011. Chiranjeevi served as a Rajya Sabha MP from 2012 to 2018 and was appointed Minister of Tourism in the central cabinet of India in October 2012, holding the position until May 2014. After a hiatus from cinema, he returned with the blockbuster hit Khaidi No. 150 (2017), followed by successful films such as Sye Raa Narasimha Reddy (2019) and Waltair Veerayya (2023).</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 181.4183880026388,
            "ascendant": 7
        },
        "planets": {
            "Jupiter": {
                "degree": 111.77200617562596,
                "cusp_degree": 21.77200617562596,
                "motion_speed": 0.21718019079125778,
                "zodiac": 4,
                "house": 10,
                "motion": "D"
            },
            "Sun": {
                "degree": 125.06990734559601,
                "cusp_degree": 5.0699073455960075,
                "motion_speed": 0.9635175261164741,
                "zodiac": 5,
                "house": 11,
                "motion": "D"
            },
            "Moon": {
                "degree": 179.27812129642595,
                "cusp_degree": 29.27812129642595,
                "motion_speed": 12.63037298839796,
                "zodiac": 6,
                "house": 12,
                "motion": "D"
            },
            "Venus": {
                "degree": 122.29086069465951,
                "cusp_degree": 2.2908606946595143,
                "motion_speed": 1.2376780968394239,
                "zodiac": 5,
                "house": 11,
                "motion": "D"
            },
            "Mars": {
                "degree": 123.41850692000178,
                "cusp_degree": 3.418506920001775,
                "motion_speed": 0.6364418954741353,
                "zodiac": 5,
                "house": 11,
                "motion": "D"
            },
            "Mercury": {
                "degree": 140.41438277154958,
                "cusp_degree": 20.414382771549583,
                "motion_speed": 1.699279405939122,
                "zodiac": 5,
                "house": 11,
                "motion": "D"
            },
            "Saturn": {
                "degree": 202.17512585752698,
                "cusp_degree": 22.17512585752698,
                "motion_speed": 0.05299062925957653,
                "zodiac": 7,
                "house": 1,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 240.82290041241316,
                "cusp_degree": 0.822900412413162,
                "motion_speed": -0.10345931843156674,
                "zodiac": 9,
                "house": 3,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 239.8343648716753,
                "cusp_degree": 29.83436487167529,
                "motion_speed": -0.0529920805190524,
                "zodiac": 8,
                "house": 2,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 59.83436487167529,
                "motion_speed": -0.0529920805190524,
                "cusp_degree": 29.83436487167529,
                "zodiac": 2,
                "house": 8,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 60.82290041241316,
                "motion_speed": -0.10345931843156674,
                "cusp_degree": 0.822900412413162,
                "zodiac": 3,
                "house": 9,
                "motion": "R"
            }
        }
    }
}
