{
    "request": {
        "name": "Donald Trump ",
        "title": "Politician/Businessman",
        "year": 1946,
        "month": 6,
        "day": 14,
        "hour": 10,
        "minute": 45,
        "second": 0,
        "latitude": 40.7127281,
        "longitude": -74.0060152,
        "location": "New york City, United States",
        "agyat_rating": "AA",
        "about": "<p>Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who is the 47th president of the United States. A member of the Republican Party, he served as the 45th president from 2017 to 2021.</p><p>Born into a wealthy family in the New York City borough of Queens, Trump graduated from the University of Pennsylvania in 1968 with a bachelor's degree in economics. He became the president of his family's real estate business in 1971, renamed it the Trump Organization, and began acquiring and building skyscrapers, hotels, casinos, and golf courses. He launched side ventures, many licensing the Trump name, and filed for six business bankruptcies in the 1990s and 2000s. From 2004 to 2015, he hosted the reality television show The Apprentice, bolstering his fame as a billionaire. A political outsider, Trump won the 2016 presidential election against the Democratic Party's nominee, Hillary Clinton.</p><p>During his first presidency, Trump imposed a travel ban on seven Muslim-majority countries, expanded the Mexico–United States border wall, and enforced a family separation policy on the border. He rolled back environmental and business regulations, signed the Tax Cuts and Jobs Act, and appointed three Supreme Court justices. In foreign policy, Trump withdrew the U.S. from agreements on climate, trade, and Iran's nuclear program, and initiated a trade war with China. In response to the COVID-19 pandemic from 2020, he downplayed its severity, contradicted health officials, and signed the CARES Act. After losing the 2020 presidential election to Joe Biden, Trump attempted to overturn the result, culminating in the January 6 Capitol attack in 2021. Trump was impeached in 2019 for abuse of power and obstruction of Congress, and in 2021 for incitement of insurrection; the Senate acquitted him both times. After his first term, scholars and historians ranked him as one of the worst presidents in American history.</p><p>Trump is the central figure of Trumpism, and his faction is dominant within the Republican Party. Many of his comments and actions have been characterized as racist or misogynistic, and he has made false and misleading statements and promoted conspiracy theories to a degree unprecedented in American politics. Trump's actions, especially in his second term, have been described as authoritarian and contributing to democratic backsliding. In 2023, Trump was found liable in civil cases for sexual abuse and defamation and for business fraud, and in 2024, he was found guilty of falsifying business records, making him the first U.S. president convicted of a felony. After winning the 2024 presidential election against Kamala Harris, Trump was sentenced to a penalty-free discharge, and two felony indictments against him were dismissed.</p><p>Trump began his second presidency by pardoning around 1,500 January 6 rioters and initiating mass layoffs of federal workers. He imposed tariffs on nearly all countries and began trade wars with Canada, Mexico, and China. Many of his administration's actions, including his unprecedented use of executive orders and deportations of immigrants, have drawn lawsuits challenging their legality.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 136.06310645633081,
            "ascendant": 5
        },
        "planets": {
            "Jupiter": {
                "degree": 174.34769981182188,
                "cusp_degree": 24.347699811821883,
                "motion_speed": -0.0003682471314041649,
                "zodiac": 6,
                "house": 2,
                "motion": "R"
            },
            "Sun": {
                "degree": 59.855511555532054,
                "cusp_degree": 29.855511555532054,
                "motion_speed": 0.954744169192433,
                "zodiac": 2,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 238.4904154161499,
                "cusp_degree": 28.490415416149887,
                "motion_speed": 11.86302816255317,
                "zodiac": 8,
                "house": 4,
                "motion": "D"
            },
            "Venus": {
                "degree": 92.67299403262413,
                "cusp_degree": 2.672994032624132,
                "motion_speed": 1.189548817065058,
                "zodiac": 4,
                "house": 12,
                "motion": "D"
            },
            "Mars": {
                "degree": 123.68998084432576,
                "cusp_degree": 3.68998084432576,
                "motion_speed": 0.558123262660307,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Mercury": {
                "degree": 75.81622551931015,
                "cusp_degree": 15.816225519310152,
                "motion_speed": 1.8668109509515802,
                "zodiac": 3,
                "house": 11,
                "motion": "D"
            },
            "Saturn": {
                "degree": 90.71511561020179,
                "cusp_degree": 0.7151156102017922,
                "motion_speed": 0.11729443446077524,
                "zodiac": 4,
                "house": 12,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 57.69937318458625,
                "cusp_degree": 27.69937318458625,
                "motion_speed": -0.00012581551568369457,
                "zodiac": 2,
                "house": 10,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 57.650545698597774,
                "cusp_degree": 27.650545698597774,
                "motion_speed": -0.05299202309763733,
                "zodiac": 2,
                "house": 10,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 237.65054569859777,
                "motion_speed": -0.05299202309763733,
                "cusp_degree": 27.650545698597767,
                "zodiac": 8,
                "house": 4,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 237.69937318458625,
                "motion_speed": -0.00012581551568369457,
                "cusp_degree": 27.69937318458625,
                "zodiac": 8,
                "house": 4,
                "motion": "R"
            }
        }
    }
}
