{
    "request": {
        "name": "Smt. Indira Gandhi",
        "title": "Politician, Prime Minister",
        "year": 1917,
        "month": 11,
        "day": 19,
        "hour": 23,
        "minute": 11,
        "second": 0,
        "latitude": 25.4381302,
        "longitude": 81.8338005,
        "location": "Allahabad, Uttar Pradesh",
        "agyat_rating": "AA",
        "gender": "female",
        "dod": "31/10/1984",
        "advanced": "gunned-down, legal-trouble, marriage, death by accident",
        "about": "<p>Indira Priyadarshini Gandhi[b] (née Nehru; 19 November 1917 – 31 October 1984) was an Indian politician and stateswoman who served as the prime minister of India from 1966 to 1977 and again from 1980 until her assassination in 1984. She was India's first and, to date, only female prime minister, and a central figure in Indian politics as the leader of the Indian National Congress (INC). She was the daughter of Jawaharlal Nehru, the first prime minister of India, and the mother of Rajiv Gandhi, who succeeded her in office as the country's prime minister. Gandhi's cumulative tenure of 15 years and 350 days makes her the second-longest-serving Indian prime minister after her father. Henry Kissinger described her as an \"Iron Lady\", a nickname that became associated with her tough personality.</p><p> During her father Jawaharlal Nehru's premiership from 1947 to 1964, Gandhi was his hostess and accompanied him on his numerous foreign trips. In 1959, she played a part in the dissolution of the communist-led Kerala state government as then-president of the Indian National Congress, otherwise a ceremonial position to which she was elected earlier that year. Lal Bahadur Shastri, who had succeeded Nehru as prime minister upon his death in 1964, appointed her minister of information and broadcasting in his government; the same year she was elected to the Rajya Sabha, the upper house of the Indian Parliament. After Shastri's sudden death in January 1966, Gandhi defeated her rival, Morarji Desai, in the INC's parliamentary leadership election to become leader and also succeeded Shastri as prime minister. She led the Congress to victory in two subsequent elections, starting with the 1967 general election, in which she was first elected to the lower house of the Indian parliament, the Lok Sabha. In 1971, her party secured its first landslide victory since her father's sweep in 1962, focusing on issues such as poverty. But following the nationwide state of emergency she implemented, she faced massive anti-incumbency sentiment causing the INC to lose the 1977 election, the first time in the history of India to happen so. She even lost her own parliamentary constituency. However, due to her portrayal as a strong leader and the weak governance of the Janata Party, her party won the next election by a landslide and she returned to the premiership.</p><p> As prime minister, Gandhi was known for her uncompromising political stances and centralization of power within the executive branch. In 1967, she headed a military conflict with China in which India repelled Chinese incursions into the Himalayas. In 1971, she went to war with Pakistan in support of the independence movement and war of independence in East Pakistan, which resulted in an Indian victory and the independence of Bangladesh, as well as increasing India's influence to the point where it became the sole regional power in South Asia. She played a crucial role in initiating India's first successful nuclear weapon test in 1974. Her rule saw India grow closer to the Soviet Union by signing a friendship treaty in 1971, with India receiving military, financial, and diplomatic support from the Soviet Union during its conflict with Pakistan in the same year. Though India was at the forefront of the non-aligned movement, Gandhi made it one of the Soviet Union's closest allies in Asia, each often supporting the other in proxy wars and at the United Nations. Responding to separatist tendencies and a call for revolution, she instituted a state of emergency from 1975 to 1977, during which she ruled by decree and basic civil liberties were suspended. More than 100,000 political opponents, journalists and dissenters were imprisoned. She faced the growing Sikh separatism movement throughout her fourth premiership; in response, she ordered Operation Blue Star, which involved military action in the Golden Temple and killed hundreds of Sikhs. On 31 October 1984, she was assassinated by two of her bodyguards, both of whom were Sikh nationalists seeking retribution for the events at the temple.</p><p> Gandhi is remembered as the most powerful woman in the world during her tenure. Her supporters cite her leadership during victories over geopolitical rivals China and Pakistan, the Green Revolution, a growing economy in the early 1980s, and her anti-poverty campaign that led her to be known as \"Mother Indira\" (a pun on Mother India) among the country's poor and rural classes. Critics note her cult of personality and authoritarian rule of India during the Emergency. In 1999, she was named \"Woman of the Millennium\" in an online poll organized by the BBC. In 2020, she was named by Time magazine among the 100 women who defined the past century as counterparts to the magazine's previous choices for Man of the Year.</p>",
        "related": ["gandhi-family"]
    },
    "response": {
        "ascendant": {
            "asc_deg": 112.32563286204615,
            "ascendant": 4
        },
        "planets": {
            "Sun": {
                "degree": 214.1090389831704,
                "cusp_degree": 4.109038983170393,
                "motion_speed": 1.009831409586596,
                "zodiac": 8,
                "house": 5,
                "motion": "D"
            },
            "Moon": {
                "degree": 275.3674011617911,
                "cusp_degree": 5.367401161791122,
                "motion_speed": 13.816312008789417,
                "zodiac": 10,
                "house": 7,
                "motion": "D"
            },
            "Mercury": {
                "degree": 223.20482153239453,
                "cusp_degree": 13.204821532394533,
                "motion_speed": 1.5400913054909033,
                "zodiac": 8,
                "house": 5,
                "motion": "D"
            },
            "Venus": {
                "degree": 260.9882537607107,
                "cusp_degree": 20.988253760710677,
                "motion_speed": 1.0719307698639144,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Mars": {
                "degree": 136.366892919111,
                "cusp_degree": 16.366892919110995,
                "motion_speed": 0.5039975617915003,
                "zodiac": 5,
                "house": 2,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 45.00398123925695,
                "cusp_degree": 15.003981239256952,
                "motion_speed": -0.13208264560685565,
                "zodiac": 2,
                "house": 11,
                "motion": "R"
            },
            "Saturn": {
                "degree": 111.78713824949635,
                "cusp_degree": 21.78713824949635,
                "motion_speed": 0.012094687448478206,
                "zodiac": 4,
                "house": 1,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 249.20448440799137,
                "cusp_degree": 9.204484407991373,
                "motion_speed": 0.02669485182641592,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 250.5663239863197,
                "cusp_degree": 10.566323986319702,
                "motion_speed": -0.05299228245496534,
                "zodiac": 9,
                "house": 6,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 70.56632398631973,
                "motion_speed": -0.05299228245496534,
                "cusp_degree": 10.56632398631973,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 69.20448440799134,
                "motion_speed": 0.02669485182641592,
                "cusp_degree": 9.204484407991345,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            }
        }
    }
}
