{
    "request": {
        "name": "J Jayalalitha",
        "title": "Actor, Politician, Chief Minister",
        "year": 1948,
        "month": 2,
        "day": 24,
        "hour": 13,
        "minute": 7,
        "second": 0,
        "latitude": 12.7007519,
        "longitude": 76.66255674080558,
        "location": "Malukote, Tamilnadu",
        "agyat_rating": "AA",
        "about": "<p>Jayaram Jayalalithaa (24 February 1948 – 5 December 2016), popularly known as Amma, was an Indian actress, politician, and philanthropist who served as the chief minister of Tamil Nadu for more than fourteen years between 1991 and 2016. She served as chief minister until her death and became the first female chief minister to die in office in the Republic of India. She was the longest-serving and former general secretary of the All India Anna Dravida Munnetra Kazhagam, a Dravidian party founded by her mentor and the former chief minister of Tamil Nadu M. G. Ramachandran (M.G.R.). Jayalalithaa is regarded as one of the most influential politicians of post-independence India. Apart from politics, as a film personality, she won the Tamil Nadu State Film Awards and three Filmfare Awards South.</p><p> Jayalalithaa rose to prominence as a leading film actress in the mid-1960s. Though she had begun her acting career reluctantly at her mother's behest to support the family, Jayalalithaa was a prolific actor. She appeared in 140 films between 1961 and 1980, primarily in the Tamil, Telugu and Kannada languages. Jayalalithaa received praise for her versatility as an actress and her dancing skills, earning the sobriquet \"Queen of Tamil Cinema\".</p><p> Among her frequent co-stars was M. G. Ramachandran. In 1982, when M. G. Ramachandran was Chief Minister, Jayalalithaa joined AIADMK, the party he founded. Her political rise was rapid; within a few years she became AIADMK propaganda secretary and was elected to the Rajya Sabha, the upper house of India's Parliament. After M.G.R.'s death in 1987, Jayalalithaa proclaimed herself as his political heir and, having fought off the faction headed by M.G.R.'s widow, V. N. Janaki Ramachandran, emerged as the sole leader of the AIADMK. Following the 1989 election, she became Leader of the Opposition to the DMK-led government led by M. Karunanidhi, her bête noire.</p><p> In 1991, Jayalalithaa became Chief Minister for the first time and was Tamil Nadu's youngest. She earned a reputation for centralising state power among a coterie of bureaucrats; her council of ministers, whom she often shuffled around, were largely ceremonial in nature. The successful cradle-baby scheme, which enabled mothers to anonymously offer their newborns for adoption, emerged during this time. Despite an official salary of only a rupee a month, Jayalalithaa indulged in public displays of wealth, culminating in a lavish wedding for her foster son V. N. Sudhakaran (Sasikala's nephew) on 7 September 1995. In the 1996 election, the AIADMK was nearly wiped out at the hustings; Jayalalithaa herself lost her seat. The new Karunanidhi government filed 28 corruption cases against her, and she had to spend time in jail.</p><p> Her fortunes revived in the 1998 general election, as the AIADMK became a key component of Prime Minister Atal Bihari Vajpayee's 1998–99 government; her withdrawal of support toppled it and triggered another general election just a year later.</p><p> The AIADMK returned to power in 2001, although Jayalalithaa was personally disbarred from contesting due to the corruption cases. Within a few months of her taking oath as chief minister, in September 2001, she was disqualified from holding office and forced to cede the chair to loyalist O. Panneerselvam. Upon her acquittal six months later, Jayalalithaa returned as chief minister to complete her term. Noted for its ruthlessness to political opponents including M. Karunanidhi, many of whom were arrested in midnight raids, her government grew unpopular. Another period (2006–11) in the opposition followed, before Jayalalithaa was sworn in as chief minister for the fourth time after the AIADMK swept the 2011 assembly election.</p><p> Her government received attention for its extensive social-welfare agenda, which included several subsidised \"Amma\"-branded goods such as canteens, bottled water, salt and cement. Three years into her tenure, she was convicted in a disproportionate-assets case, rendering her disqualified to hold office. She returned as chief minister after being acquitted in May 2015. In the 2016 assembly election, she became the first Tamil Nadu chief minister since M.G.R in 1984 to be voted back into office. That September, she fell severely ill and, following 75 days of hospitalisation, died on 5 December 2016 due to cardiac arrest and became the first female chief minister in India to die in office.</p><p> Jayalalithaa never married and had no children.</p><p> On 29 May 2020, her nephew, Deepak Jayakumar, and niece, J. Deepa, were declared as her legal heirs by Madras High Court. Her critics in the media and the opposition accused her of fostering a personality cult and of demanding absolute loyalty from AIADMK legislators and ministers.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 51.901629340476475,
            "ascendant": 2
        },
        "planets": {
            "Jupiter": {
                "degree": 242.0018975671298,
                "cusp_degree": 2.001897567129788,
                "motion_speed": 0.1399873116591743,
                "zodiac": 9,
                "house": 8,
                "motion": "D"
            },
            "Sun": {
                "degree": 311.47006189340027,
                "cusp_degree": 11.47006189340027,
                "motion_speed": 1.0057800836551476,
                "zodiac": 11,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 125.51324773530689,
                "cusp_degree": 5.513247735306891,
                "motion_speed": 15.291554378261338,
                "zodiac": 5,
                "house": 4,
                "motion": "D"
            },
            "Venus": {
                "degree": 351.7586031956059,
                "cusp_degree": 21.758603195605872,
                "motion_speed": 1.177675825467585,
                "zodiac": 12,
                "house": 11,
                "motion": "D"
            },
            "Mars": {
                "degree": 122.1916845155863,
                "cusp_degree": 2.191684515586303,
                "motion_speed": -0.38209038975944387,
                "zodiac": 5,
                "house": 4,
                "motion": "R"
            },
            "Mercury": {
                "degree": 302.75297920578504,
                "cusp_degree": 2.7529792057850386,
                "motion_speed": -0.9656594468555485,
                "zodiac": 11,
                "house": 10,
                "motion": "R"
            },
            "Saturn": {
                "degree": 114.90213882781667,
                "cusp_degree": 24.90213882781667,
                "motion_speed": -0.07620899462851959,
                "zodiac": 4,
                "house": 3,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 23.839252900443167,
                "cusp_degree": 23.839252900443167,
                "motion_speed": -0.18171086690579716,
                "zodiac": 1,
                "house": 12,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 24.814124191584945,
                "cusp_degree": 24.814124191584945,
                "motion_speed": -0.052992087701839566,
                "zodiac": 1,
                "house": 12,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 204.81412419158494,
                "motion_speed": -0.052992087701839566,
                "cusp_degree": 24.814124191584938,
                "zodiac": 7,
                "house": 6,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 203.83925290044317,
                "motion_speed": -0.18171086690579716,
                "cusp_degree": 23.83925290044317,
                "zodiac": 7,
                "house": 6,
                "motion": "R"
            }
        }
    }
}
