{
    "request": {
        "name": "Joe Biden",
        "title": "Politician",
        "year": 1942,
        "month": 11,
        "day": 20,
        "hour": 8,
        "minute": 30,
        "second": 0,
        "latitude": 41.40916,
        "longitude": -75.6649,
        "location": "Scranton, United States",
        "agyat_rating": "AA",
        "about": "<p>Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician who was the 46th president of the United States from 2021 to 2025. A member of the Democratic Party, he served as the 47th vice president from 2009 to 2017 under President Barack Obama, and represented Delaware in the U.S. Senate from 1973 to 2009.</p><p>Born in Scranton, Pennsylvania, Biden graduated from the University of Delaware in 1965 and the Syracuse University College of Law in 1968. He was elected to the New Castle County Council in 1970 and the U.S. Senate in 1972. As a senator, Biden chaired the Senate Judiciary Committee and Foreign Relations Committee. He drafted and led passage of the Violent Crime Control and Law Enforcement Act and the Violence Against Women Act. He also oversaw six U.S. Supreme Court confirmation hearings, including contentious hearings for Robert Bork and Clarence Thomas. He opposed the Gulf War in 1991 but voted in favor of the Iraq War Resolution in 2002. Biden ran unsuccessfully for the 1988 and 2008 Democratic presidential nominations. In 2008, Obama chose Biden as his running mate, and he was a close counselor to Obama as vice president. In the 2020 presidential election, Biden selected Kamala Harris as his running mate, and they defeated Republican incumbents Donald Trump and Mike Pence. He became the first president to serve with a female or African American vice president.</p><p>As president, Biden signed the American Rescue Plan Act, Infrastructure Investment and Jobs Act, CHIPS and Science Act, and Inflation Reduction Act in response to the COVID-19 pandemic and subsequent recession. He appointed Ketanji Brown Jackson to the Supreme Court of the United States. In his foreign policy, the U.S. reentered the Paris Agreement. Biden oversaw the complete withdrawal of U.S. troops that ended the war in Afghanistan, leading to the Taliban seizing control. He responded to the Russian invasion of Ukraine by imposing sanctions on Russia and authorizing aid to Ukraine. During the Gaza war, Biden condemned the actions of Hamas as terrorism, strongly supported Israel's military efforts, and sent limited humanitarian aid to the Gaza Strip. A temporary ceasefire proposal he backed was adopted shortly before he left office.</p><p>Concerns about Biden's age and health persisted throughout his term. He became the first president to turn 80 while in office. He began his presidency with majority support, but saw his approval ratings decline significantly throughout his presidency, in part due to public frustration over inflation, which peaked at 9.1% in June 2022 but dropped to 2.9% by the end of his presidency. Biden initially ran for reelection and, after the Democratic primaries, became the party's presumptive nominee in the 2024 presidential election. After his performance in the first presidential debate, renewed scrutiny from across the political spectrum about his cognitive ability led him to withdraw his candidacy. In 2022 and 2024, Biden's administration was ranked favorably by historians and scholars, diverging from less favorable public assessments of his tenure. As of 2025, he is the oldest living former U.S. president.</p>",
        "related": ["biden-family"]
    },
    "response": {
        "ascendant": {
            "asc_deg": 231.62219605619447,
            "ascendant": 8
        },
        "planets": {
            "Jupiter": {
                "degree": 92.07640020326774,
                "cusp_degree": 2.076400203267738,
                "motion_speed": -0.026476809487645688,
                "zodiac": 4,
                "house": 9,
                "motion": "R"
            },
            "Sun": {
                "degree": 214.54236083540997,
                "cusp_degree": 4.542360835409966,
                "motion_speed": 1.0093486069027109,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Moon": {
                "degree": 8.422450960476686,
                "cusp_degree": 8.422450960476686,
                "motion_speed": 12.60041267908825,
                "zodiac": 1,
                "house": 6,
                "motion": "D"
            },
            "Venus": {
                "degree": 215.54671227158448,
                "cusp_degree": 5.546712271584482,
                "motion_speed": 1.25640618445271,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Mars": {
                "degree": 199.5605552563546,
                "cusp_degree": 19.560555256354604,
                "motion_speed": 0.6832071579676824,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Mercury": {
                "degree": 208.54221342388564,
                "cusp_degree": 28.54221342388564,
                "motion_speed": 1.5952051634872109,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Saturn": {
                "degree": 46.89326250852284,
                "cusp_degree": 16.893262508522838,
                "motion_speed": -0.07909436515671432,
                "zodiac": 2,
                "house": 7,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 127.08516111517166,
                "cusp_degree": 7.085161115171658,
                "motion_speed": -0.18794750601475363,
                "zodiac": 5,
                "house": 10,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 126.6511838712792,
                "cusp_degree": 6.651183871279201,
                "motion_speed": -0.0529920265683387,
                "zodiac": 5,
                "house": 10,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 306.6511838712792,
                "motion_speed": -0.0529920265683387,
                "cusp_degree": 6.6511838712792155,
                "zodiac": 11,
                "house": 4,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 307.0851611151717,
                "motion_speed": -0.18794750601475363,
                "cusp_degree": 7.0851611151716725,
                "zodiac": 11,
                "house": 4,
                "motion": "R"
            }
        }
    }
}
