{
    "request": {
        "name": "Julius Robert Oppenheimer",
        "title": "Scientist",
        "year": 1904,
        "month": 4,
        "day": 22,
        "hour": 8,
        "minute": 15,
        "second": 0,
        "latitude": 40.7127281,
        "longitude": -74.0060152,
        "location": "New York City",
        "agyat_rating": "UU",
        "about": "<p>American scientist, a theoretical physicist, often called the \"father of the atomic bomb.\" He was the director of the Manhattan Project's Los Alamos Laboratory in New Mexico during World War II, tasked with developing the first nuclear weapons. In August 1945, the weapons were used against Japan in the bombings of Hiroshima and Nagasaki, the only use to date of nuclear weapons in an armed conflict. Post-war, he was head of the Atomic Energy Commission's General Advisory Committee (1947-1952).</p><p> After World War II he lobbied for international control of nuclear power to avert nuclear proliferation and a nuclear arms race with the Soviet Union. He opposed the development of the hydrogen bomb during a 1949–1950 governmental debate on the question and subsequently took positions on defence-related issues that provoked the ire of some U.S. government and military factions. Declared a security risk in 1953, his security clearance was revoked following a 1954 security hearing. This effectively ended his access to the government's atomic secrets and thus his career as a nuclear physicist. He became head of the Institute of Advanced Study at Princeton, 1953-1966, and received the Enrico Fermi Award in 1963.</p><p> He made significant contributions to theoretical physics, including achievements in quantum mechanics and nuclear physics such as the Born–Oppenheimer approximation for molecular wave functions, work on the theory of electrons and positrons, the Oppenheimer–Phillips process in nuclear fusion, and the first prediction of quantum tunnelling. With his students, he also made contributions to the theory of neutron stars and black holes, quantum field theory, and the interactions of cosmic rays.</p><p> Born in New York City to Jewish immigrants from Germany, Oppenheimer earned a bachelor's degree in chemistry from Harvard University in 1925 and a doctorate in physics from the University of Göttingen in Germany in 1927. After research at other institutions, he joined the physics department at the University of California, Berkeley, where he became a full professor in 1936.</p><p> From 1936 to 1939, Oppenheimer was romantically involved with Jean Tatlock. In August 1939, he met Katherine (\"Kitty\") Puening, a radical Berkeley student and former Communist Party member. Kitty married Richard Harrison, a physician and medical researcher, in 1938. Oppenheimer and Kitty created a minor scandal by sleeping together after a party. In the summer of 1940, she stayed with Oppenheimer at his ranch in New Mexico. She finally asked Harrison for a divorce when she found out she was pregnant. When he refused, she obtained a quick divorce in Reno, Nevada, and took Oppenheimer as her fourth husband on 1 November 1940.</p><p> Their first child, Peter, was born in May 1941, and their second, Katherine (\"Toni\"), was born in Los Alamos, New Mexico, on 7 December 1944. During his marriage, Oppenheimer rekindled his affair with Tatlock. She committed suicide on 4 January 1944, leaving Oppenheimer deeply grieved. He died from throat cancer on 18 February 1967 at age 62 in Princeton, New Jersey.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 63.60459468387825,
            "ascendant": 3
        },
        "planets": {
            "Jupiter": {
                "degree": 350.0524955870526,
                "cusp_degree": 20.05249558705259,
                "motion_speed": 0.23474816608822102,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Sun": {
                "degree": 9.449846344336207,
                "cusp_degree": 9.449846344336207,
                "motion_speed": 0.9744723854405846,
                "zodiac": 1,
                "house": 11,
                "motion": "D"
            },
            "Moon": {
                "degree": 90.9162469838185,
                "cusp_degree": 0.9162469838184961,
                "motion_speed": 13.940526332624245,
                "zodiac": 4,
                "house": 2,
                "motion": "D"
            },
            "Venus": {
                "degree": 349.0119357642912,
                "cusp_degree": 19.011935764291195,
                "motion_speed": 1.2257430328835457,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Mars": {
                "degree": 19.09872250837928,
                "cusp_degree": 19.09872250837928,
                "motion_speed": 0.7288654028994108,
                "zodiac": 1,
                "house": 11,
                "motion": "D"
            },
            "Mercury": {
                "degree": 29.43496005238006,
                "cusp_degree": 29.43496005238006,
                "motion_speed": 0.9064706237880973,
                "zodiac": 1,
                "house": 11,
                "motion": "D"
            },
            "Saturn": {
                "degree": 297.2468391247522,
                "cusp_degree": 27.246839124752228,
                "motion_speed": 0.061081278070656275,
                "zodiac": 10,
                "house": 8,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 154.43025764152094,
                "cusp_degree": 4.430257641520939,
                "motion_speed": -0.015524990311498255,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 153.36322924173245,
                "cusp_degree": 3.363229241732455,
                "motion_speed": -0.052992096821506865,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 333.3632292417325,
                "motion_speed": -0.052992096821506865,
                "cusp_degree": 3.3632292417324834,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 334.43025764152094,
                "motion_speed": -0.015524990311498255,
                "cusp_degree": 4.430257641520939,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            }
        }
    }
}
