{
    "request": {
        "name": "Justin Trudeau",
        "title": "Politician",
        "year": 1971,
        "month": 12,
        "day": 25,
        "hour": 21,
        "minute": 27,
        "second": 0,
        "latitude": 45.4208777,
        "longitude": -75.6901106,
        "location": "Ottawa, Canada",
        "agyat_rating": "AA",
        "gender": "male",
        "about": "<p>Justin Pierre James Trudeau (born December 25, 1971) is a Canadian former politician who served as the 23rd prime minister of Canada from 2015 to 2025. A member of the Liberal Party of Canada, he served as the party's leader from 2013 until his resignation in 2025 and was a member of parliament (MP) for Papineau from 2008 until 2025.</p><p>Trudeau was born in Ottawa, Ontario, as the eldest son of Prime Minister Pierre Trudeau, and attended Collège Jean-de-Brébeuf. He holds a Bachelor of Arts degree in English from McGill University and a Bachelor of Education degree from the University of British Columbia. After graduating, he taught at the secondary school level in Vancouver before returning to Montreal in 2002 to further his studies. He was chair for the youth charity Katimavik and director of the not-for-profit Canadian Avalanche Association. In 2006, he was appointed as chair of the Liberal Party's Task Force on Youth Renewal. In the 2008 federal election, he was elected to represent the riding of Papineau in the House of Commons. He was the Liberal Party's Official Opposition critic for youth and multiculturalism in 2009; in 2010, he became critic for citizenship and immigration. In 2011, he was appointed as a critic for secondary education and sport. In 2013, Trudeau was elected as the leader of the Liberal Party and led the party to a majority government in the 2015 federal election. He became the second-youngest prime minister in Canadian history and the first to be the child of a previous prime minister.</p><p>Major government initiatives Trudeau undertook during his first term included establishing the Canada Child Benefit, legalizing medical assistance in dying, legalizing recreational marijuana through the Cannabis Act, attempting Senate appointment reform by establishing the Independent Advisory Board for Senate Appointments, and establishing the federal carbon tax. In foreign policy, Trudeau's government negotiated trade deals such as the Canada-United States-Mexico Agreement (CUSMA) and the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, and signed the Paris Agreement on climate change. He was sanctioned by Canada's ethics commissioner for violating conflict of interest law regarding the Aga Khan affair, and again with the SNC-Lavalin affair.</p><p>Trudeau's Liberal Party was reduced to a minority government in the 2019 federal election. His government responded to the COVID-19 pandemic, announced an \"assault-style\" weapons ban in response to the 2020 Nova Scotia attacks, and launched a national $10-a-day childcare program. He was investigated for a third time by the ethics commissioner for his part in the WE Charity scandal, but was cleared of wrongdoing. In the 2021 federal election, he led the Liberals to another minority government. In 2022, he invoked the Emergencies Act in response to the Freedom Convoy protests and responded to the Russian invasion of Ukraine by imposing sanctions on Russia and authorizing military aid to Ukraine. His party signed a confidence and supply agreement with the New Democratic Party (NDP) in early 2022, which resulted in the enactment of the Canadian Dental Care Plan for residents who meet a certain income threshold and a framework for national pharmacare; in late 2024, the NDP opted to terminate the agreement. In early 2025, in response to the second Trump tariffs, Trudeau announced 25% retaliatory tariffs on $30 billion worth of U.S. goods.</p><p>Following a steady decline in public support, the sudden resignation of Deputy Prime Minister Chrystia Freeland in December 2024 and an ensuing political crisis, Trudeau announced on January 6, 2025, that he would resign as both the prime minister and leader of the Liberal Party. He advised the governor general to prorogue parliament until March 24, while the party held a leadership contest. Trudeau remained leader until Mark Carney was chosen on March 9, prime minister until Carney was sworn in on March 14, and MP for Papineau until the federal election on April 28.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 133.64918623879848,
            "ascendant": 5
        },
        "planets": {
            "Jupiter": {
                "degree": 237.5677501176883,
                "cusp_degree": 27.56775011768829,
                "motion_speed": 0.22408449709615635,
                "zodiac": 8,
                "house": 4,
                "motion": "D"
            },
            "Sun": {
                "degree": 250.196822459347,
                "cusp_degree": 10.196822459347004,
                "motion_speed": 1.0188537891888485,
                "zodiac": 9,
                "house": 5,
                "motion": "D"
            },
            "Moon": {
                "degree": 354.00450162603465,
                "cusp_degree": 24.004501626034653,
                "motion_speed": 14.264126123359565,
                "zodiac": 12,
                "house": 8,
                "motion": "D"
            },
            "Venus": {
                "degree": 280.0492125140739,
                "cusp_degree": 10.049212514073872,
                "motion_speed": 1.23715943908456,
                "zodiac": 10,
                "house": 6,
                "motion": "D"
            },
            "Mars": {
                "degree": 336.1211869114675,
                "cusp_degree": 6.1211869114674755,
                "motion_speed": 0.6413220932203998,
                "zodiac": 12,
                "house": 8,
                "motion": "D"
            },
            "Mercury": {
                "degree": 229.27358321410577,
                "cusp_degree": 19.27358321410577,
                "motion_speed": 0.4580346740928964,
                "zodiac": 8,
                "house": 4,
                "motion": "D"
            },
            "Saturn": {
                "degree": 37.293213633962004,
                "cusp_degree": 7.293213633962004,
                "motion_speed": -0.061582849491644394,
                "zodiac": 2,
                "house": 10,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 282.2027327012285,
                "cusp_degree": 12.202732701228513,
                "motion_speed": -0.025912548296400145,
                "zodiac": 10,
                "house": 6,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 283.4752224609432,
                "cusp_degree": 13.4752224609432,
                "motion_speed": -0.05299206472753875,
                "zodiac": 10,
                "house": 6,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 103.4752224609432,
                "motion_speed": -0.05299206472753875,
                "cusp_degree": 13.4752224609432,
                "zodiac": 4,
                "house": 12,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 102.20273270122851,
                "motion_speed": -0.025912548296400145,
                "cusp_degree": 12.202732701228513,
                "zodiac": 4,
                "house": 12,
                "motion": "R"
            }
        }
    }
}
