{
    "request": {
        "name": "King Charles III ",
        "title": "Monarch",
        "year": 1948,
        "month": 11,
        "day": 14,
        "hour": 21,
        "minute": 14,
        "second": 0,
        "latitude": 51.4893335,
        "longitude": -0.14405508452768728,
        "location": "London, United Kingdom",
        "agyat_rating": "AA",
        "about": "Charles III (Charles Philip Arthur George; born 14 November 1948) is King of the United Kingdom and the 14 other Commonwealth realms since 2022.\n Charles was born at Buckingham Palace during the reign of his maternal grandfather, King George VI, and became heir apparent when his mother, Queen Elizabeth II, acceded to the throne in 1952. He was created Prince of Wales in 1958 and his investiture was held in 1969. He was educated at Cheam School and Gordonstoun, and later spent six months at the Timbertop campus of Geelong Grammar School in Victoria, Australia. After completing a history degree from the University of Cambridge, Charles served in the Royal Air Force and the Royal Navy from 1971 to 1976. In 1981, he married Lady Diana Spencer. They had two sons, William and Harry. After years of estrangement, Charles and Diana divorced in 1996, after they had each engaged in well-publicised extramarital affairs. Diana died as a result of injuries sustained in a car crash the following year. In 2005, Charles married his long-term partner, Camilla Parker Bowles.\n As heir apparent, Charles undertook official duties and engagements on behalf of his mother and represented the United Kingdom on visits abroad. He founded The Prince's Trust in 1976, sponsored the Prince's Charities, and became patron or president of more than 800 other charities and organisations. He advocated for the conservation of historic buildings and the importance of traditional architecture in society. In that vein, he generated the experimental new town of Poundbury. An environmentalist, Charles supported organic farming and action to prevent climate change during his time as the manager of the Duchy of Cornwall estates, earning him awards and recognition as well as criticism; he is also a prominent critic of the adoption of genetically modified food, while his support for alternative medicine has been criticised. He has authored or co-authored 17 books.\n Charles became king upon his mother's death in 2022. At the age of 73, he was the oldest person to accede to the British throne, after having been the longest-serving heir apparent and Prince of Wales in British history. Significant events in his reign have included his coronation in 2023 and his cancer diagnosis the following year, the latter of which temporarily suspended planned public engagements."
    },
    "response": {
        "ascendant": {
            "asc_deg": 102.43234908984046,
            "ascendant": 4
        },
        "planets": {
            "Sun": {
                "degree": 209.28335123244187,
                "cusp_degree": 29.283351232441873,
                "motion_speed": 1.007224381971594,
                "zodiac": 7,
                "house": 4,
                "motion": "D"
            },
            "Moon": {
                "degree": 7.2998786730228975,
                "cusp_degree": 7.2998786730228975,
                "motion_speed": 12.425200691592883,
                "zodiac": 1,
                "house": 10,
                "motion": "D"
            },
            "Mercury": {
                "degree": 193.8181585227792,
                "cusp_degree": 13.818158522779214,
                "motion_speed": 1.511749138871132,
                "zodiac": 7,
                "house": 4,
                "motion": "D"
            },
            "Venus": {
                "degree": 173.24486791381918,
                "cusp_degree": 23.244867913819178,
                "motion_speed": 1.2139223482905062,
                "zodiac": 6,
                "house": 3,
                "motion": "D"
            },
            "Mars": {
                "degree": 237.8092519385813,
                "cusp_degree": 27.809251938581298,
                "motion_speed": 0.746485068532143,
                "zodiac": 8,
                "house": 5,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 246.74576356211819,
                "cusp_degree": 6.745763562118185,
                "motion_speed": 0.2047567968193491,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Saturn": {
                "degree": 132.12755801842775,
                "cusp_degree": 12.127558018427749,
                "motion_speed": 0.05689139186051362,
                "zodiac": 5,
                "house": 2,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 11.820062854263487,
                "cusp_degree": 11.820062854263487,
                "motion_speed": 0.005293267189575784,
                "zodiac": 1,
                "house": 10,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 10.793288517900564,
                "cusp_degree": 10.793288517900564,
                "motion_speed": -0.05299198767687875,
                "zodiac": 1,
                "house": 10,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 190.79328851790058,
                "motion_speed": -0.05299198767687875,
                "cusp_degree": 10.793288517900578,
                "zodiac": 7,
                "house": 4,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 191.82006285426348,
                "motion_speed": 0.005293267189575784,
                "cusp_degree": 11.820062854263483,
                "zodiac": 7,
                "house": 4,
                "motion": "R"
            }
        }
    }
}
