{
    "request": {
        "name": "L. K. Adwani",
        "title": "Politician",
        "year": 1927,
        "month": 11,
        "day": 8,
        "hour": 9,
        "minute": 5,
        "second": 0,
        "latitude": 24.8546842,
        "longitude": 67.0207055,
        "location": "Karachi, Pakistan",
        "agyat_rating": "AA",
        "advanced": "legal-troubles, detention",
        "about": "<p>Lal Krishna Advani (born 8 November 1927) is an Indian politician and statesman who served as the 7th Deputy Prime Minister of India from 2002 to 2004. He is one of the co-founders of Bharatiya Janata Party (BJP) and a member of the Rashtriya Swayamsevak Sangh (RSS), a right-wing Hindu nationalist volunteer organization. He is the longest serving Minister of Home Affairs serving from 1998 to 2004. He is also the longest serving Leader of the Opposition in the Lok Sabha as well as the longest serving President of the BJP, the current ruling party of India. He was the prime ministerial candidate of the BJP during the 2009 general election, also in 1989 and 1991.</p><p> Advani was born in Karachi and migrated to India during the Partition of India and settled down in Bombay where he completed his college education. Advani joined the RSS in 1941 at the age of fourteen and worked as a pracharak in Rajasthan. In 1951, Advani became a member of the Bharatiya Jana Sangh founded by Syama Prasad Mookerjee and performed various roles including in charge of parliamentary affairs, general secretary, and president of the Delhi unit. In 1967, he was elected as the chairman of the First Delhi metropolitan council and served till 1970 while becoming a member of the RSS national executive. In 1970, Advani became a member of the Rajya Sabha for the first time and would go on to serve four terms till 1989. He became the president of Jana Sangh in 1973 and Jana Sangh merged into the Janata Party before the 1977 general election. Following the Janata party's victory in the elections, Advani became the union minister for Information and Broadcasting and leader of the house in Rajya Sabha.</p><p> In 1980, he was one of the founding members of the BJP along with Atal Bihari Vajpayee and served as the president of the party three times. He was elected to the Lok Sabha for the first time in 1989 where he served seven terms. In 1992, he was alleged to have been part of the Demolition of the Babri Masjid, but was acquitted by the courts due to lack of evidence. Following the same, he was one of the chief proponents of the movement to build a temple over the disputed Ram Janmabhoomi site in Ayodhya and the subsequent rise of Hindutva politics in the late 1990s. He has served as leader of opposition in both the houses. He was the minister of home affairs from 1998 to 2004 and deputy prime minister from 2002 to 2004. He served in the Indian parliament until 2019 and is credited for rise of BJP as a major political party. In 2015, he was awarded the Padma Vibhushan, India's second highest civilian honour and in 2024, he was conferred with Bharat Ratna, India's highest civilian honour.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 239.0647892783461,
            "ascendant": 8
        },
        "planets": {
            "Sun": {
                "degree": 201.93275796244748,
                "cusp_degree": 21.932757962447482,
                "motion_speed": 1.0036848719650664,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Moon": {
                "degree": 6.523752439682105,
                "cusp_degree": 6.523752439682105,
                "motion_speed": 15.242328808903716,
                "zodiac": 1,
                "house": 6,
                "motion": "D"
            },
            "Mercury": {
                "degree": 206.67028398410076,
                "cusp_degree": 26.670283984100763,
                "motion_speed": -1.26477667237541,
                "zodiac": 7,
                "house": 12,
                "motion": "R"
            },
            "Venus": {
                "degree": 155.92886087255812,
                "cusp_degree": 5.9288608725581184,
                "motion_speed": 0.8894495442416123,
                "zodiac": 6,
                "house": 11,
                "motion": "D"
            },
            "Mars": {
                "degree": 196.1146607316433,
                "cusp_degree": 16.114660731643312,
                "motion_speed": 0.6842117176133466,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 330.9948740785647,
                "cusp_degree": 0.9948740785646919,
                "motion_speed": -0.03954338711386624,
                "zodiac": 12,
                "house": 5,
                "motion": "R"
            },
            "Saturn": {
                "degree": 224.39483696393805,
                "cusp_degree": 14.394836963938047,
                "motion_speed": 0.11251710456836492,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 56.243791523886685,
                "cusp_degree": 26.243791523886685,
                "motion_speed": -0.08107658914628862,
                "zodiac": 2,
                "house": 7,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 57.65014308421958,
                "cusp_degree": 27.65014308421958,
                "motion_speed": -0.052992074164348334,
                "zodiac": 2,
                "house": 7,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 237.65014308421956,
                "motion_speed": -0.052992074164348334,
                "cusp_degree": 27.650143084219565,
                "zodiac": 8,
                "house": 1,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 236.24379152388667,
                "motion_speed": -0.08107658914628862,
                "cusp_degree": 26.24379152388667,
                "zodiac": 8,
                "house": 1,
                "motion": "R"
            }
        }
    }
}
