{
    "request": {
        "name": "Mahatma Gandhi",
        "title": "Politician, National Figure",
        "year": 1869,
        "month": 10,
        "day": 2,
        "hour": 8,
        "minute": 36,
        "second": 0,
        "latitude": 21.6409,
        "longitude": 69.611,
        "location": "Porbandar, Gujarat",
        "agyat_rating": "AA",
        "about": "<p>Mohandas Karamchand Gandhi (2 October 1869 – 30 January 1948) was an Indian lawyer, anti-colonial nationalist, and political ethicist who employed nonviolent resistance to lead the successful campaign for India's independence from British rule. He inspired movements for civil rights and freedom across the world. The honorific Mahātmā (from Sanskrit, meaning great-souled, or venerable), first applied to him in South Africa in 1914, is now used throughout the world.</p><p> Born and raised in a Hindu family in coastal Gujarat, Gandhi trained in the law at the Inner Temple in London and was called to the bar at the age of 22. After two uncertain years in India, where he was unable to start a successful law practice, Gandhi moved to South Africa in 1893 to represent an Indian merchant in a lawsuit. He went on to live in South Africa for 21 years. Here, Gandhi raised a family and first employed nonviolent resistance in a campaign for civil rights. In 1915, aged 45, he returned to India and soon set about organising peasants, farmers, and urban labourers to protest against discrimination and excessive land tax.</p><p> Assuming leadership of the Indian National Congress in 1921, Gandhi led nationwide campaigns for easing poverty, expanding women's rights, building religious and ethnic amity, ending untouchability, and, above all, achieving swaraj or self-rule. Gandhi adopted the short dhoti woven with hand-spun yarn as a mark of identification with India's rural poor. He began to live in a self-sufficient residential community, to eat simple food, and undertake long fasts as a means of both introspection and political protest. Bringing anti-colonial nationalism to the common Indians, Gandhi led them in challenging the British-imposed salt tax with the 400 km (250 mi) Dandi Salt March in 1930 and in calling for the British to quit India in 1942. He was imprisoned many times and for many years in both South Africa and India.</p><p> Gandhi's vision of an independent India based on religious pluralism was challenged in the early 1940s by a Muslim nationalism which demanded a separate homeland for Muslims within British India. In August 1947, Britain granted independence, but the British Indian Empire was partitioned into two dominions, a Hindu-majority India and a Muslim-majority Pakistan. As many displaced Hindus, Muslims, and Sikhs made their way to their new lands, religious violence broke out, especially in the Punjab and Bengal. Abstaining from the official celebration of independence, Gandhi visited the affected areas, attempting to alleviate distress. In the months following, he undertook several hunger strikes to stop the religious violence. The last of these was begun in Delhi on 12 January 1948, when Gandhi was 78. The belief that Gandhi had been too resolute in his defence of both Pakistan and Indian Muslims spread among some Hindus in India. Among these was Nathuram Godse, a militant Hindu nationalist from Pune, western India, who assassinated Gandhi by firing three bullets into his chest at an interfaith prayer meeting in Delhi on 30 January 1948.</p><p> Gandhi's birthday, 2 October, is commemorated in India as Gandhi Jayanti, a national holiday, and worldwide as the International Day of Nonviolence. Gandhi is considered to be the Father of the Nation in post-colonial India. During India's nationalist movement and in several decades immediately after, he was also commonly called Bapu, an endearment roughly meaning \"father\".</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 192.00329978971726,
            "ascendant": 7
        },
        "planets": {
            "Sun": {
                "degree": 166.9157592813572,
                "cusp_degree": 16.915759281357197,
                "motion_speed": 0.9853206449014169,
                "zodiac": 6,
                "house": 12,
                "motion": "D"
            },
            "Moon": {
                "degree": 118.26402226344565,
                "cusp_degree": 28.264022263445653,
                "motion_speed": 14.438874504749997,
                "zodiac": 4,
                "house": 10,
                "motion": "D"
            },
            "Mercury": {
                "degree": 191.74949896231104,
                "cusp_degree": 11.749498962311037,
                "motion_speed": 0.6169470833277148,
                "zodiac": 7,
                "house": 1,
                "motion": "D"
            },
            "Venus": {
                "degree": 204.42652657217863,
                "cusp_degree": 24.42652657217863,
                "motion_speed": 1.1939769590775329,
                "zodiac": 7,
                "house": 1,
                "motion": "D"
            },
            "Mars": {
                "degree": 206.3816076844776,
                "cusp_degree": 26.381607684477586,
                "motion_speed": 0.6977541731520687,
                "zodiac": 7,
                "house": 1,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 28.137083055014948,
                "cusp_degree": 28.137083055014948,
                "motion_speed": -0.07316780041104641,
                "zodiac": 1,
                "house": 7,
                "motion": "R"
            },
            "Saturn": {
                "degree": 230.32958855729686,
                "cusp_degree": 20.32958855729686,
                "motion_speed": 0.07245727173400093,
                "zodiac": 8,
                "house": 2,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 103.65854224311816,
                "cusp_degree": 13.658542243118163,
                "motion_speed": -0.030080874691560518,
                "zodiac": 4,
                "house": 10,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 102.14605075612555,
                "cusp_degree": 12.146050756125547,
                "motion_speed": -0.052992130099028645,
                "zodiac": 4,
                "house": 10,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 282.14605075612553,
                "motion_speed": -0.052992130099028645,
                "cusp_degree": 12.146050756125533,
                "zodiac": 10,
                "house": 4,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 283.6585422431182,
                "motion_speed": -0.030080874691560518,
                "cusp_degree": 13.658542243118177,
                "zodiac": 10,
                "house": 4,
                "motion": "R"
            }
        }
    }
}
