{
    "request": {
        "name": "Merilyn Monroe",
        "title": "Actor",
        "year": 1926,
        "month": 6,
        "day": 1,
        "hour": 10,
        "minute": 0,
        "second": 0,
        "latitude": 34.0536909,
        "longitude": -118.242766,
        "location": "Los Angeles, United States",
        "agyat_rating": "AA",
        "about": "<p>Marilyn Monroe (/ˈmærəlɪn mənˈroʊ/ MARR-ə-lin mən-ROH; born Norma Jeane Mortenson; June 1, 1926 – August 4, 1962) was an American actress and model. Known for playing comic \"blonde bombshell\" characters, she became one of the most popular sex symbols of the 1950s and early 1960s, as well as an emblem of the era's sexual revolution. She was a top-billed actress for a decade, and her films grossed $200 million (equivalent to $2 billion in 2024) by her death in 1962.</p><p> Born in Los Angeles, Monroe spent most of her childhood in foster homes and an orphanage before marrying James Dougherty at the age of 16. She was working in a factory during World War II when she met a photographer from the First Motion Picture Unit and began a successful pin-up modeling career, which led to short-lived film contracts with 20th Century Fox and Columbia Pictures. After roles as a freelancer, she began a longer contract with Fox in 1951, becoming a popular actress with roles in several comedies, including As Young as You Feel and Monkey Business, and in the dramas Clash by Night and Don't Bother to Knock. Monroe faced a scandal when it was revealed that she had posed for nude photographs prior to fame, but the story resulted in increased interest in her films.</p><p> Monroe became one of the most marketable Hollywood stars in 1953. She had leading roles in the film noir Niagara, which overtly relied on her sex appeal, and the comedies Gentlemen Prefer Blondes and How to Marry a Millionaire, which established her star image as a \"dumb blonde\". The same year, her nude images were used as the centerfold and cover of the first issue of Playboy. Monroe played a significant role in the creation and management of her public image, but felt disappointed when typecast and underpaid by the studio. She was briefly suspended in early 1954 for refusing a film project but returned to star in The Seven Year Itch (1955), one of the biggest box office successes of her career.</p><p> When the studio was still reluctant to change Monroe's contract, she founded her own film production company in 1954 with her friend Milton Greene. She dedicated 1955 to building the company and began studying method acting under Lee Strasberg at the Actors Studio. Later that year, Fox awarded her a new contract, which gave her more control and a larger salary. Her subsequent roles included a critically acclaimed performance in Bus Stop (1956) and her first independent production in The Prince and the Showgirl (1957), for which she received a BAFTA nomination. She won a Golden Globe for her role in Some Like It Hot (1959), a critical and commercial success. Her last completed film was the drama The Misfits (1961).</p><p> Monroe's troubled private life received much attention. Her marriages to retired baseball star Joe DiMaggio and to playwright Arthur Miller were highly publicized; both ended in divorce. On August 4, 1962, Monroe died at age 36 of an overdose of barbiturates at her Los Angeles home. Her death was ruled a probable suicide. Monroe remains a pop culture icon, with the American Film Institute ranking her as the sixth-greatest female screen legend from the Golden Age of Hollywood.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 114.99388278233681,
            "ascendant": 4
        },
        "planets": {
            "Sun": {
                "degree": 47.63500315624211,
                "cusp_degree": 17.635003156242107,
                "motion_speed": 0.9578649509457461,
                "zodiac": 2,
                "house": 11,
                "motion": "D"
            },
            "Moon": {
                "degree": 296.5011882620818,
                "cusp_degree": 26.501188262081826,
                "motion_speed": 14.240782670090473,
                "zodiac": 10,
                "house": 7,
                "motion": "D"
            },
            "Mercury": {
                "degree": 43.98879803132346,
                "cusp_degree": 13.988798031323462,
                "motion_speed": 2.1790849469960842,
                "zodiac": 2,
                "house": 11,
                "motion": "D"
            },
            "Venus": {
                "degree": 5.943832373497446,
                "cusp_degree": 5.943832373497446,
                "motion_speed": 1.1311120192065867,
                "zodiac": 1,
                "house": 10,
                "motion": "D"
            },
            "Mars": {
                "degree": 327.9181673315999,
                "cusp_degree": 27.918167331599875,
                "motion_speed": 0.7042456982763378,
                "zodiac": 11,
                "house": 8,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 304.00179174999073,
                "cusp_degree": 4.00179174999073,
                "motion_speed": 0.04623775065515562,
                "zodiac": 11,
                "house": 8,
                "motion": "D"
            },
            "Saturn": {
                "degree": 208.61590299078378,
                "cusp_degree": 28.61590299078378,
                "motion_speed": -0.06865983741885212,
                "zodiac": 7,
                "house": 4,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 84.07008308222807,
                "cusp_degree": 24.070083082228066,
                "motion_speed": 0.022533002986350973,
                "zodiac": 3,
                "house": 12,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 85.44169307746246,
                "cusp_degree": 25.44169307746246,
                "motion_speed": -0.052992141808522915,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 265.44169307746245,
                "motion_speed": -0.052992141808522915,
                "cusp_degree": 25.441693077462446,
                "zodiac": 9,
                "house": 6,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 264.07008308222805,
                "motion_speed": 0.022533002986350973,
                "cusp_degree": 24.070083082228052,
                "zodiac": 9,
                "house": 6,
                "motion": "R"
            }
        }
    }
}
