{
    "request": {
        "name": "Mithun Chakraborty ",
        "title": "Actor/Politician",
        "year": 1950,
        "month": 6,
        "day": 16,
        "hour": 5,
        "minute": 40,
        "second": 0,
        "latitude": 22.5726459,
        "longitude": 88.3638953,
        "location": "Kolkata, West Bengal",
        "agyat_rating": "AA",
        "about": "Mithun Chakraborty (born Gouranga Chakraborty; 16 June 1950) is an Indian actor, film producer, screenwriter, entrepreneur and politician who predominantly works in Hindi and Bengali cinema. In a career spanning over five decades, he has done 350 films, mostly in Hindi and Bengali languages, and a few in Odia, Telugu, Kannada, Punjabi and Tamil. He is a former Rajya Sabha Member of Parliament. He is the recipient of three National Film Awards and four Filmfare Awards. In January 2024, Chakraborty was awarded Padma Bhushan, the third-highest civilian honour by the Government of India. He was also awarded India's highest accolade in the field of cinema, the Dadasaheb Phalke Award for the year 2022, whose announcement came from the Union Ministry of Information and Broadcasting in September 2024.\n Chakraborty made his acting debut with the art house drama Mrigayaa (1976), directed by Mrinal Sen, for which he won his first National Film Award for Best Actor. Chakraborty gained greater fame with the 1982 film Disco Dancer, which was a major box office success in India and the Soviet Union. Besides Disco Dancer, Chakraborty also gained recognition for many other performances as both a lead and character artist. Chakraborty's performance in Agneepath won him the Filmfare Award for Best Supporting Actor in 1990.\n Chakraborty owns the Monarch Group, which has interests in the hospitality and educational sectors. He also started the production house Paparatzy Productions. In 1992, he, along with Dilip Kumar and Sunil Dutt, set up a trust to help actors in need of assistance called Cine & T.V Artistes Association (CINTAA). He was also the Chairperson of Film Studios Setting & Allied Mazdoor Union, which protects the welfare of cinema workers and resolves their demands and problems. The television show Dance India Dance, where Chakraborty was the Grand Master, also entered in the Limca Book of Records and the Guinness World Records. Chakraborty played a crucial mediating role between Pranab Mukherjee of the Indian National Congress and Mamata Banerjee, winning Mukherjee the support of Banerjee's party, the All India Trinamool Congress, in the 2012 Indian presidential election. He joined the Bharatiya Janata Party (BJP) on 7 March 2021, ahead of the 2021 West Bengal Legislative Assembly election."
    },
    "response": {
        "ascendant": {
            "asc_deg": 71.34383221174863,
            "ascendant": 3
        },
        "planets": {
            "Sun": {
                "degree": 61.12937832405421,
                "cusp_degree": 1.1293783240542083,
                "motion_speed": 0.9552209246146719,
                "zodiac": 3,
                "house": 1,
                "motion": "D"
            },
            "Moon": {
                "degree": 65.0102556283617,
                "cusp_degree": 5.010255628361705,
                "motion_speed": 12.220775659612777,
                "zodiac": 3,
                "house": 1,
                "motion": "D"
            },
            "Mercury": {
                "degree": 38.5738453236302,
                "cusp_degree": 8.573845323630202,
                "motion_speed": 1.2794073008465299,
                "zodiac": 2,
                "house": 12,
                "motion": "D"
            },
            "Venus": {
                "degree": 23.465551601490013,
                "cusp_degree": 23.465551601490013,
                "motion_speed": 1.1627886064892803,
                "zodiac": 1,
                "house": 11,
                "motion": "D"
            },
            "Mars": {
                "degree": 158.40644420711808,
                "cusp_degree": 8.406444207118085,
                "motion_speed": 0.3905859113203745,
                "zodiac": 6,
                "house": 4,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 314.0936428006163,
                "cusp_degree": 14.093642800616294,
                "motion_speed": 0.0350831306286379,
                "zodiac": 11,
                "house": 9,
                "motion": "D"
            },
            "Saturn": {
                "degree": 140.2651034555508,
                "cusp_degree": 20.265103455550786,
                "motion_speed": 0.052453360606051116,
                "zodiac": 5,
                "house": 3,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 340.6377220091009,
                "cusp_degree": 10.637722009100912,
                "motion_speed": -0.22391893936841606,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 340.15743768567603,
                "cusp_degree": 10.15743768567603,
                "motion_speed": -0.05299205236864788,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 160.1574376856761,
                "motion_speed": -0.05299205236864788,
                "cusp_degree": 10.157437685676086,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 160.6377220091009,
                "motion_speed": -0.22391893936841606,
                "cusp_degree": 10.637722009100912,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            }
        }
    }
}
