{
    "request": {
        "name": "Narendra Modi ",
        "title": "Politician",
        "year": 1950,
        "month": 9,
        "day": 17,
        "hour": 10,
        "minute": 10,
        "second": 0,
        "latitude": 23.7853622,
        "longitude": 72.6332132,
        "location": "Vadnagar, Gujrat",
        "agyat_rating": "AA",
        "about": "Narendra Damodardas Modi (born 17 September 1950) is an Indian politician who has served as the prime minister of India since 2014. Modi was the chief minister of Gujarat from 2001 to 2014 and is the member of parliament (MP) for Varanasi. He is a member of the Bharatiya Janata Party (BJP) and of the Rashtriya Swayamsevak Sangh (RSS), a far-right Hindu nationalist paramilitary volunteer organisation. He is the longest-serving prime minister outside the Indian National Congress.\n Modi was born and raised in Vadnagar in northeastern Gujarat, where he completed his secondary education. He was introduced to the RSS at the age of eight. At the age of 18, he was married to Jashodaben Modi, whom he abandoned soon after, only publicly acknowledging her four decades later when legally required to do so. Modi became a full-time worker for the RSS in Gujarat in 1971. The RSS assigned him to the BJP in 1985 and he rose through the party hierarchy, becoming general secretary in 1998. In 2001, Modi was appointed chief minister of Gujarat and elected to the legislative assembly soon after. His administration is considered complicit in the 2002 Gujarat riots, and has been criticised for its management of the crisis. According to official records, a little over 1,000 people were killed, three-quarters of whom were Muslim; independent sources estimated 2,000 deaths, mostly Muslim. A Special Investigation Team appointed by the Supreme Court of India in 2012 found no evidence to initiate prosecution proceedings against him. While his policies as chief minister were credited for encouraging economic growth, his administration was criticised for failing to significantly improve health, poverty and education indices in the state.\n In the 2014 Indian general election, Modi led the BJP to a parliamentary majority, the first for a party since 1984. His administration increased direct foreign investment, and reduced spending on healthcare, education, and social-welfare programmes. Modi began a high-profile sanitation campaign, and weakened or abolished environmental and labour laws. His demonetisation of banknotes in 2016 and introduction of the Goods and Services Tax in 2017 sparked controversy. Modi's administration launched the 2019 Balakot airstrike against an alleged terrorist training camp in Pakistan. The airstrike failed, but the action had nationalist appeal. Modi's party won the 2019 general election which followed. In its second term, his administration revoked the special status of Jammu and Kashmir, and introduced the Citizenship Amendment Act, prompting widespread protests, and spurring the 2020 Delhi riots in which Muslims were brutalised and killed by Hindu mobs. Three controversial farm laws led to sit-ins by farmers across the country, eventually causing their formal repeal. Modi oversaw India's response to the COVID-19 pandemic, during which, according to the World Health Organization's estimates, 4.7 million Indians died. In the 2024 general election, Modi's party lost its majority in the lower house of Parliament and formed a government leading the National Democratic Alliance coalition.\n Under Modi's tenure, India has experienced democratic backsliding, or the weakening of democratic institutions, individual rights, and freedom of expression. As prime minister, he has received consistently high approval ratings. Modi has been described as engineering a political realignment towards right-wing politics. He remains a controversial figure domestically and internationally, over his Hindu nationalist beliefs and handling of the Gujarat riots, which have been cited as evidence of a majoritarian and exclusionary social agenda."
    },
    "response": {
        "ascendant": {
            "asc_deg": 195.1781722952512,
            "ascendant": 7
        },
        "planets": {
            "Sun": {
                "degree": 150.54228135857198,
                "cusp_degree": 0.5422813585719837,
                "motion_speed": 0.975779214484195,
                "zodiac": 6,
                "house": 12,
                "motion": "D"
            },
            "Moon": {
                "degree": 218.07908122285662,
                "cusp_degree": 8.079081222856615,
                "motion_speed": 14.3799412115854,
                "zodiac": 8,
                "house": 2,
                "motion": "D"
            },
            "Mercury": {
                "degree": 150.83777487078865,
                "cusp_degree": 0.8377748707886497,
                "motion_speed": -1.0470805657449496,
                "zodiac": 6,
                "house": 12,
                "motion": "R"
            },
            "Venus": {
                "degree": 135.6244884834146,
                "cusp_degree": 15.62448848341461,
                "motion_speed": 1.238483487761772,
                "zodiac": 5,
                "house": 11,
                "motion": "D"
            },
            "Mars": {
                "degree": 210.8953111349744,
                "cusp_degree": 0.8953111349744063,
                "motion_speed": 0.679166501030634,
                "zodiac": 8,
                "house": 2,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 306.60032600695354,
                "cusp_degree": 6.600326006953537,
                "motion_speed": -0.10907337884237724,
                "zodiac": 11,
                "house": 5,
                "motion": "R"
            },
            "Saturn": {
                "degree": 149.64507035681206,
                "cusp_degree": 29.645070356812056,
                "motion_speed": 0.12488012808981534,
                "zodiac": 5,
                "house": 11,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 335.21046340053607,
                "cusp_degree": 5.210463400536071,
                "motion_speed": 0.005493981869665519,
                "zodiac": 12,
                "house": 6,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 335.22008654992015,
                "cusp_degree": 5.220086549920154,
                "motion_speed": -0.05299208523460478,
                "zodiac": 12,
                "house": 6,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 155.2200865499201,
                "motion_speed": -0.05299208523460478,
                "cusp_degree": 5.220086549920097,
                "zodiac": 6,
                "house": 12,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 155.21046340053613,
                "motion_speed": 0.005493981869665519,
                "cusp_degree": 5.210463400536128,
                "zodiac": 6,
                "house": 12,
                "motion": "R"
            }
        }
    }
}
