{
    "request": {
        "name": "Nelson Mandela",
        "title": "Activist",
        "year": 1918,
        "month": 7,
        "day": 18,
        "hour": 14,
        "minute": 54,
        "second": 0,
        "latitude": -33.9288301,
        "longitude": 18.4172197,
        "location": "Cape Town, South Africa",
        "agyat_rating": "AA",
        "about": "Nelson Rolihlahla Mandela (/mænˈdɛlə/ man-DEL-ə, Xhosa: [xolíɬaɬa mandɛ̂ːla]; born Rolihlahla Mandela; 18 July 1918 – 5 December 2013) was a South African anti-apartheid activist and politician who served as the first president of South Africa from 1994 to 1999. He was the country's first black head of state and the first elected in a fully representative democratic election. His government focused on dismantling the legacy of apartheid by fostering racial reconciliation. Ideologically an African nationalist and socialist, he served as the president of the African National Congress (ANC) party from 1991 to 1997.\n A Xhosa, Mandela was born into the Thembu royal family in Mvezo, South Africa. He studied law at the University of Fort Hare and the University of Witwatersrand before working as a lawyer in Johannesburg. There he became involved in anti-colonial and African nationalist politics, joining the ANC in 1943 and co-founding its Youth League in 1944. After the National Party's white-only government established apartheid, a system of racial segregation that privileged whites, Mandela and the ANC committed themselves to its overthrow. He was appointed president of the ANC's Transvaal branch, rising to prominence for his involvement in the 1952 Defiance Campaign and the 1955 Congress of the People. He was repeatedly arrested for seditious activities and was unsuccessfully prosecuted in the 1956 Treason Trial. Influenced by Marxism, he secretly joined the banned South African Communist Party (SACP). Although initially committed to non-violent protest, in association with the SACP he co-founded the militant uMkhonto we Sizwe in 1961 that led a sabotage campaign against the apartheid government. He was arrested and imprisoned in 1962, and, following the Rivonia Trial, was sentenced to life imprisonment for conspiring to overthrow the state.\n Mandela served 27 years in prison, split between Robben Island, Pollsmoor Prison, and Victor Verster Prison. Amid growing domestic and international pressure and fears of racial civil war, President F. W. de Klerk released him in 1990. Mandela and de Klerk led efforts to negotiate an end to apartheid, which resulted in the 1994 multiracial general election in which Mandela led the ANC to victory and became president. Leading a broad coalition government which promulgated a new constitution, Mandela emphasised reconciliation between the country's racial groups and created the Truth and Reconciliation Commission to investigate past human rights abuses. Economically, his administration retained its predecessor's liberal framework despite his own socialist beliefs, also introducing measures to encourage land reform, combat poverty and expand healthcare services. Internationally, Mandela acted as mediator in the Pan Am Flight 103 bombing trial and served as secretary-general of the Non-Aligned Movement from 1998 to 1999. He declined a second presidential term and was succeeded by his deputy, Thabo Mbeki. Mandela became an elder statesman and focused on combating poverty and HIV/AIDS through the charitable Nelson Mandela Foundation.\n Mandela was a controversial figure for much of his life. Although critics on the right denounced him as a communist terrorist and those on the far left deemed him too eager to negotiate and reconcile with apartheid's supporters, he gained international acclaim for his activism. Globally regarded as an icon of democracy and social justice, he received more than 250 honours, including the Nobel Peace Prize. He is held in deep respect within South Africa, where he is often referred to by his Thembu clan name, Madiba, and described as the \"Father of the Nation\"."
    },
    "response": {
        "ascendant": {
            "asc_deg": 234.28314817173367,
            "ascendant": 8
        },
        "planets": {
            "Sun": {
                "degree": 92.35173885620031,
                "cusp_degree": 2.3517388562003134,
                "motion_speed": 0.9540853414119321,
                "zodiac": 4,
                "house": 9,
                "motion": "D"
            },
            "Moon": {
                "degree": 207.59963636400067,
                "cusp_degree": 27.599636364000673,
                "motion_speed": 12.26057800334775,
                "zodiac": 7,
                "house": 12,
                "motion": "D"
            },
            "Mercury": {
                "degree": 113.41791157591311,
                "cusp_degree": 23.41791157591311,
                "motion_speed": 1.6109849301580095,
                "zodiac": 4,
                "house": 9,
                "motion": "D"
            },
            "Venus": {
                "degree": 59.861606723226515,
                "cusp_degree": 29.861606723226515,
                "motion_speed": 1.1856488345286407,
                "zodiac": 2,
                "house": 7,
                "motion": "D"
            },
            "Mars": {
                "degree": 169.85692409142953,
                "cusp_degree": 19.856924091429534,
                "motion_speed": 0.5494531677794304,
                "zodiac": 6,
                "house": 11,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 68.4443819579683,
                "cusp_degree": 8.444381957968304,
                "motion_speed": 0.21889565589799104,
                "zodiac": 3,
                "house": 8,
                "motion": "D"
            },
            "Saturn": {
                "degree": 112.30876967932956,
                "cusp_degree": 22.308769679329558,
                "motion_speed": 0.12313537279990938,
                "zodiac": 4,
                "house": 9,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 239.1143711351274,
                "cusp_degree": 29.114371135127413,
                "motion_speed": 0.027668544189013107,
                "zodiac": 8,
                "house": 1,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 237.80465082054025,
                "cusp_degree": 27.804650820540246,
                "motion_speed": -0.05299201692517248,
                "zodiac": 8,
                "house": 1,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 57.804650820540246,
                "motion_speed": -0.05299201692517248,
                "cusp_degree": 27.804650820540246,
                "zodiac": 2,
                "house": 7,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 59.114371135127385,
                "motion_speed": 0.027668544189013107,
                "cusp_degree": 29.114371135127385,
                "zodiac": 2,
                "house": 7,
                "motion": "R"
            }
        }
    }
}
