{
    "request": {
        "name": "Nitish Kumar",
        "title": "Politician",
        "year": 1951,
        "month": 3,
        "day": 1,
        "hour": 13,
        "minute": 20,
        "second": 0,
        "latitude": 25.4586233,
        "longitude": 85.5369022,
        "location": "Bakhtiyarpur, Bihar",
        "agyat_rating": "AA",
        "about": "<p>Nitish Kumar (born 1 March 1951) is an Indian politician who has been serving as the 22nd chief minister of Bihar since 22 February 2015, having previously held the office from 2005 to 2014 and for a short period in 2000. He is Bihar's longest serving chief minister whilst also holding the post for his 9th term.</p><p> He is the leader of the Janata Dal (United). Previously, Kumar also served as a Union Minister as the Samata Party member. He was member of the Samata Party until 2005 and Janata Dal from 1989 to 1994. Kumar first entered politics as a member of the Janata Dal, becoming an MLA in 1985. A socialist, Kumar founded the Samata Party in 1994 along with George Fernandes. In 1996 he was elected to the Lok Sabha, and served as a Union Minister in the government of Atal Bihari Vajpayee, with his party joining the National Democratic Alliance. In 2003 his party merged into the Janata Dal (United), and Kumar became its leader. In 2005, the NDA won a majority in the Bihar Legislative Assembly, and Kumar became chief minister heading a coalition with the Bharatiya Janata Party.</p><p> In the 2010 state elections, the governing coalition won re-election in a landslide. In June 2013, Kumar broke with the BJP after Narendra Modi was named as their candidate for prime minister, and formed the Mahagathbandhan, a coalition with the Rashtriya Janata Dal and Indian National Congress and joined in United Progressive Alliance. On 17 May 2014, Kumar resigned as chief minister after the party suffered severe losses in the 2014 Indian general election, and was replaced by Jitan Ram Manjhi. However, he attempted to return as chief minister in February 2015, sparking a political crisis that eventually saw Manjhi resign and Kumar become chief minister again. Later that year, the Mahagathbandhan won a large majority in the state elections. In 2017, Kumar broke with the RJD over corruption allegations and returned to the NDA, leading another coalition with the BJP; at the 2020 state elections his government was narrowly reelected. In August 2022, Kumar left the NDA, rejoining the Mahagathbandhan (Grand Alliance) and UPA. In January 2024, Kumar left the Mahagathbandhan once again and rejoined the NDA.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 73.72929204611077,
            "ascendant": 3
        },
        "planets": {
            "Jupiter": {
                "degree": 324.635467121536,
                "cusp_degree": 24.63546712153601,
                "motion_speed": 0.24125620946891446,
                "zodiac": 11,
                "house": 9,
                "motion": "D"
            },
            "Sun": {
                "degree": 316.7271970413286,
                "cusp_degree": 16.727197041328623,
                "motion_speed": 1.0037790318497113,
                "zodiac": 11,
                "house": 9,
                "motion": "D"
            },
            "Moon": {
                "degree": 231.3852591052484,
                "cusp_degree": 21.385259105248394,
                "motion_speed": 14.215668926312478,
                "zodiac": 8,
                "house": 6,
                "motion": "D"
            },
            "Venus": {
                "degree": 342.1757772108452,
                "cusp_degree": 12.175777210845183,
                "motion_speed": 1.2333768907508307,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Mars": {
                "degree": 336.3537269722861,
                "cusp_degree": 6.353726972286097,
                "motion_speed": 0.7735690194387633,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Mercury": {
                "degree": 308.16685070749077,
                "cusp_degree": 8.166850707490767,
                "motion_speed": 1.7592349743666418,
                "zodiac": 11,
                "house": 9,
                "motion": "D"
            },
            "Saturn": {
                "degree": 157.27825017298125,
                "cusp_degree": 7.278250172981245,
                "motion_speed": -0.07104774906911475,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 325.87603156918635,
                "cusp_degree": 25.876031569186352,
                "motion_speed": -0.002455318626506257,
                "zodiac": 11,
                "house": 9,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 326.46938677196016,
                "cusp_degree": 26.46938677196016,
                "motion_speed": -0.05299208480387574,
                "zodiac": 11,
                "house": 9,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 146.46938677196016,
                "motion_speed": -0.05299208480387574,
                "cusp_degree": 26.46938677196016,
                "zodiac": 5,
                "house": 3,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 145.87603156918635,
                "motion_speed": -0.002455318626506257,
                "cusp_degree": 25.876031569186352,
                "zodiac": 5,
                "house": 3,
                "motion": "R"
            }
        }
    }
}
