{
    "request": {
        "name": "Osho Rajnish",
        "title": "Spiritual, Monk",
        "year": 1931,
        "month": 12,
        "day": 11,
        "hour": 17,
        "minute": 45,
        "second": 0,
        "latitude": 26.20730275,
        "longitude": 78.28501750938239,
        "location": "Udaipura",
        "agyat_rating": "AA",
        "gender": "male",
        "advanced": "legal-troubles, detention, death by accident, poisoned",
        "dod": "19/01/1990",
        "about": "<p>Rajneesh (born Chandra Mohan Jain; 11 December 1931 – 19 January 1990), also known as Acharya Rajneesh, Bhagwan Shree Rajneesh, and later as Osho (Hindi: [ˈo:ʃo:]), was an Indian godman, philosopher, mystic and founder of the Rajneesh movement. He was viewed as a controversial new religious movement leader during his life. He rejected institutional religions, insisting that spiritual experience could not be organized into any one system of religious dogma. As a guru, he advocated meditation and taught a unique form called dynamic meditation. Rejecting traditional ascetic practices, he advocated that his followers live fully in the world but without attachment to it.</p><p> Rajneesh experienced a spiritual awakening in 1953 at the age of 21. Following several years in academia, in 1966 Rajneesh resigned his post at the University of Jabalpur as a lecturer in philosophy, and began traveling throughout India, becoming known as a vocal critic of the orthodoxy of mainstream religions, as well as of mainstream political ideologies and of Mahatma Gandhi. In 1970, Rajneesh spent time in Mumbai initiating followers known as \"neo-sannyasins\". During this period, he expanded his spiritual teachings and commented extensively in discourses on the writings of religious traditions, mystics, bhakti poets, and philosophers from around the world. In 1974, Rajneesh relocated to Pune, where an ashram was established and a variety of therapies, incorporating methods first developed by the Human Potential Movement, were offered to a growing Western following. By the late 1970s, the tension[clarification needed] between the ruling Janata Party government of Morarji Desai and the movement led to a curbing of the ashram's development and a back tax claim estimated at $5 million.</p><p> In 1981, the Rajneesh movement's efforts refocused on activities in the United States and Rajneesh relocated to a facility known as Rajneeshpuram in Wasco County, Oregon. The movement ran into conflict with county residents and the state government, and a succession of legal battles concerning the ashram's construction and continued development curtailed its success. In 1985, Rajneesh publicly asked local authorities to investigate his personal secretary Ma Anand Sheela and her close supporters for a number of crimes, including a 1984 mass food-poisoning attack intended to influence county elections, an aborted assassination plot on U.S. attorney Charles H. Turner, the attempted murder of Rajneesh's personal physician, and the bugging of his own living quarters; authorities later convicted several members of the ashram, including Sheela. That year, Rajneesh was deported from the United States on separate immigration-related charges in accordance with an Alford plea. After his deportation, 21 countries denied him entry.</p><p> Rajneesh ultimately returned to Mumbai, India, in 1986. After staying in the house of a disciple where he resumed his discourses for six months, he returned to Pune in January 1987 and revived his ashram, where he died in 1990. Rajneesh's ashram, now known as OSHO International Meditation Resort, and all associated intellectual property, is managed by the registered Osho International Foundation (formerly Rajneesh International Foundation). Rajneesh's teachings have had an impact on Western New Age thought, and their popularity reportedly increased between the time of his death and 2005.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 55.645815490245674,
            "ascendant": 2
        },
        "planets": {
            "Sun": {
                "degree": 235.5753787136387,
                "cusp_degree": 25.575378713638713,
                "motion_speed": 1.0169116982405038,
                "zodiac": 8,
                "house": 7,
                "motion": "D"
            },
            "Moon": {
                "degree": 262.41803290630287,
                "cusp_degree": 22.41803290630287,
                "motion_speed": 13.6227386573112,
                "zodiac": 9,
                "house": 8,
                "motion": "D"
            },
            "Mercury": {
                "degree": 253.48341609780428,
                "cusp_degree": 13.48341609780428,
                "motion_speed": 0.06721138644138579,
                "zodiac": 9,
                "house": 8,
                "motion": "D"
            },
            "Venus": {
                "degree": 259.2677215488097,
                "cusp_degree": 19.267721548809675,
                "motion_speed": 1.245936985647767,
                "zodiac": 9,
                "house": 8,
                "motion": "D"
            },
            "Mars": {
                "degree": 248.12668278093633,
                "cusp_degree": 8.126682780936335,
                "motion_speed": 0.7588022595027857,
                "zodiac": 9,
                "house": 8,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 119.72579511977882,
                "cusp_degree": 29.725795119778823,
                "motion_speed": -0.005922702258683012,
                "zodiac": 4,
                "house": 3,
                "motion": "R"
            },
            "Saturn": {
                "degree": 268.55575393424647,
                "cusp_degree": 28.555753934246468,
                "motion_speed": 0.10592615376194997,
                "zodiac": 9,
                "house": 8,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 339.07953869001716,
                "cusp_degree": 9.07953869001716,
                "motion_speed": -0.19006468859783524,
                "zodiac": 12,
                "house": 11,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 338.4639694369927,
                "cusp_degree": 8.463969436992727,
                "motion_speed": -0.05299193781338737,
                "zodiac": 12,
                "house": 11,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 158.46396943699278,
                "motion_speed": -0.05299193781338737,
                "cusp_degree": 8.463969436992784,
                "zodiac": 6,
                "house": 5,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 159.07953869001722,
                "motion_speed": -0.19006468859783524,
                "cusp_degree": 9.079538690017216,
                "zodiac": 6,
                "house": 5,
                "motion": "R"
            }
        }
    }
}
