{
    "request": {
        "name": "Parvez Musarraf (Army Chief)",
        "year": 1943,
        "month": 8,
        "day": 11,
        "hour": 5,
        "minute": 0,
        "second": 0,
        "latitude": 28.6273928,
        "longitude": 77.1716954,
        "location": "Delhi",
        "agyat_rating": "AA",
        "about": "Pervez Musharraf (11 August 1943 – 5 February 2023) was a Pakistani general and politician who served as the tenth president of Pakistan from 2001 to 2008.\n Prior to his career in politics, he was a four-star general and appointed as the chief of Army Staff and, later, the chairman of the Joint Chiefs of Staff by prime minister Nawaz Sharif in 1998. He was the leading war strategist in the Kargil infiltration that brought India and Pakistan to the brink of war in 1999. When prime minister Sharif unsuccessfully attempted to dismiss general Musharraf from his command assignments, the Army GHQ took over the control of the civilian government, which allowed him to control the military and the civilian government.\n In 2001, Musharraf seized the presidency through a legality and a referendum but was constitutionally confirmed in this capacity in 2004. With a new amendment to the Constitution of Pakistan, his presidency sponsored the premierships of Zafarullah Jamali and later Shaukat Aziz and played a sustaining and pivotal role in American-led War on terror in Afghanistan.\n On social issues, his presidency promoted the social liberalism under his enlightened moderation program; and on economic front, the privatization and economic liberalization was aggressively pursued though the Aziz's premiership that sharply rose the overall gross domestic product (GDP). Without the meaningful reforms and the continued banned on the trade unions, the decline of social security, and the economic inequality rose at a rapid rate. The Musharraf presidency also suffered with containing the religiously-motivated terrorism, violence, tribal nationalism, and the fundamentalism. His presidency was also accused of violating the basic rights granted in the constitution. In 2007, he attempted to seized the control of the Supreme Court by approving the relieve of the Chief Justice of Pakistan, and later suspended the writ of the constitution, which led to fall of his presidency dramatically when he resigned to avoid impeachment in 2008.\n In 2013, Musharraf returned to Pakistan to participate in the general election but was later disqualified from participating when lawsuits were filed against him in the country's high courts alleging involvement in the assassinations of nationalists Akbar Bugti and Benazir Bhutto. Furthermore, Prime Minister Sharif instructed his administration to open an inquiry and filed a proceeding in Supreme Court regarding the suspension of the writ of the constitution in 2007.\n In 2014, Musharraf was declared an \"absconder\" in the Bugti and Bhutto assassination cases by virtue of moving to Dubai due to failing health. Finally in 2019, the Special Court found Musharraf of guilty of violating the constitution in 2007, and upheld a verdict that sentenced him to death in absentia. Musharraf died at age 79 in Dubai in 2023 after a prolonged case of amyloidosis. His legacy is seen as mixed; his time in power saw the emergence of a more assertive middle class, but his open disregard for civilian institutions greatly weakened democracy and the state of Pakistan."
    },
    "response": {
        "ascendant": {
            "asc_deg": 98.59788282625956,
            "ascendant": 4
        },
        "planets": {
            "Jupiter": {
                "degree": 105.94187497990555,
                "cusp_degree": 15.941874979905549,
                "motion_speed": 0.21989449376280248,
                "zodiac": 4,
                "house": 1,
                "motion": "D"
            },
            "Sun": {
                "degree": 114.3636091228073,
                "cusp_degree": 24.363609122807304,
                "motion_speed": 0.9591851864894079,
                "zodiac": 4,
                "house": 1,
                "motion": "D"
            },
            "Moon": {
                "degree": 227.29582152101085,
                "cusp_degree": 17.29582152101085,
                "motion_speed": 13.985376205334687,
                "zodiac": 8,
                "house": 5,
                "motion": "D"
            },
            "Venus": {
                "degree": 147.06499205301918,
                "cusp_degree": 27.064992053019182,
                "motion_speed": 0.17511447070297131,
                "zodiac": 5,
                "house": 2,
                "motion": "D"
            },
            "Mars": {
                "degree": 29.262401621182967,
                "cusp_degree": 29.262401621182967,
                "motion_speed": 0.6110229139786909,
                "zodiac": 1,
                "house": 10,
                "motion": "D"
            },
            "Mercury": {
                "degree": 135.86069896756277,
                "cusp_degree": 15.860698967562769,
                "motion_speed": 1.5424809667593462,
                "zodiac": 5,
                "house": 2,
                "motion": "D"
            },
            "Saturn": {
                "degree": 60.524698884859184,
                "cusp_degree": 0.524698884859184,
                "motion_speed": 0.09392637071082752,
                "zodiac": 3,
                "house": 12,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 112.86230368501126,
                "cusp_degree": 22.862303685011256,
                "motion_speed": 0.0018956743920016937,
                "zodiac": 4,
                "house": 1,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 112.6928892101457,
                "cusp_degree": 22.692889210145694,
                "motion_speed": -0.05299202587135624,
                "zodiac": 4,
                "house": 1,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 292.6928892101457,
                "motion_speed": -0.05299202587135624,
                "cusp_degree": 22.692889210145722,
                "zodiac": 10,
                "house": 7,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 292.8623036850113,
                "motion_speed": 0.0018956743920016937,
                "cusp_degree": 22.862303685011284,
                "zodiac": 10,
                "house": 7,
                "motion": "R"
            }
        }
    }
}
