{
    "request": {
        "name": "Sri Pavan Kalyan",
        "title": "Actor, Politician",
        "year": 1967,
        "month": 9,
        "day": 2,
        "hour": 22,
        "minute": 0,
        "second": 0,
        "latitude": 16.2915189,
        "longitude": 80.4541588,
        "location": "Guntur, Andhra Pradesh",
        "agyat_rating": "AA",
        "gender": "male",
        "about": "<p>Konidela Pawan Kalyan (born Konidela Kalyan Kumar; 2 September 1971) is an Indian politician, actor, philanthropist, and martial artist serving as the 11th Deputy Chief Minister of Andhra Pradesh since June 2024. He is also the Minister of Panchayat Raj, Rural Development and Rural Water Supply; Environment, Forest, Science and Technology in the Government of Andhra Pradesh and an MLA representing the Pithapuram constituency. He is the founder and president of the Janasena Party.</p><p> As an actor, Kalyan is known for his distinctive style and mannerisms in Telugu cinema. He enjoys a huge fanbase across the Telugu states, often described as \"unfathomable,\" \"fiercely loyal,\" and akin to a \"cult following.\" He is among the highest-paid actors in Indian cinema and has been featured in Forbes India's Celebrity 100 list multiple times since 2012. He is the recipient of a Filmfare Award and a SIIMA Award among other accolades.</p><p> Kalyan made his acting debut in the 1996 film Akkada Ammayi Ikkada Abbayi. Then, he had a streak of six consecutive hits, among which Tholi Prema (1998), Thammudu (1999), Badri (2000), and Kushi (2001) became back-to-back blockbusters. These films established Kalyan as a youth icon with a massive following distinct from his elder brother Chiranjeevi's fanbase. In 2001, he became the first ever South Indian brand ambassador for Pepsi] Kalyan later faced a slump, yet his popularity kept soaring despite the flops. He made a comeback with Jalsa (2008), the highest-grossing Telugu film of that year, and continued with hits like Gabbar Singh (2012), Attarintiki Daredi (2013), Gopala Gopala (2015), and Bheemla Nayak (2022). He received the Filmfare Award for Best Actor for Gabbar Singh. Both Kushi and Attarintiki Daredi held the record for the highest-grossing Telugu film of its era.</p><p> Kalyan holds a black belt in Karate. In 1997, he was awarded the title \"Pawan\" by the Isshin-ryū Karate Association after a public martial arts demonstration. He practices various martial arts, which he regularly showcases in his films both as a performer and an action choreographer. He is known as \"Power Star\" among his fans and the media. Kalyan is also recognized for his extensive philanthropic work, supporting various social causes. He has offered financial assistance to both individuals and organizations in need. In 2007, he established the charity Common Man Protection Force.</p><p> In March 2014, Pawan Kalyan founded the Janasena Party (JSP). Although he chose not to contest the 2014 elections, his support and campaigns were pivotal in securing victory for the TDP-BJP alliance in Andhra Pradesh. He later brought national attention to the chronic kidney disease crisis in Uddanam, and led protests against forced land acquisition, and illegal mining in reserved forests. In 2019, JSP contested its first elections, winning one MLA seat with around 6% of the vote. Following this, Kalyan and JSP focused on issues like farmer welfare, illegal sand mining, women's safety, and land encroachment. In 2023, he launched a state-wide tour in his customized vehicle 'Varahi' to connect with voters. In the 2024 elections, Kalyan played a key role in forming an alliance between JSP, TDP, and BJP, which led to a landslide victory. Janasena won each of the 21 MLA seats and 2 MP seats it contested. Kalyan was elected from the Pithapuram constituency by a margin of over 70,000 votes, subsequently becoming the deputy chief minister.</p>",
        "related": ["chiranjeevi"]
    },
    "response": {
        "ascendant": {
            "asc_deg": 23.21753427708626,
            "ascendant": 1
        },
        "planets": {
            "Sun": {
                "degree": 136.10863992722224,
                "cusp_degree": 16.108639927222242,
                "motion_speed": 0.9685835459817794,
                "zodiac": 5,
                "house": 5,
                "motion": "D"
            },
            "Moon": {
                "degree": 111.89283032779002,
                "cusp_degree": 21.892830327790023,
                "motion_speed": 14.14885914081049,
                "zodiac": 4,
                "house": 4,
                "motion": "D"
            },
            "Mercury": {
                "degree": 144.46267680703275,
                "cusp_degree": 24.46267680703275,
                "motion_speed": 1.8003998052963055,
                "zodiac": 5,
                "house": 5,
                "motion": "D"
            },
            "Venus": {
                "degree": 130.1334652559154,
                "cusp_degree": 10.13346525591541,
                "motion_speed": -0.5931773089628977,
                "zodiac": 5,
                "house": 5,
                "motion": "R"
            },
            "Mars": {
                "degree": 211.82932083665546,
                "cusp_degree": 1.8293208366554552,
                "motion_speed": 0.6360335068937691,
                "zodiac": 8,
                "house": 8,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 117.54742846864102,
                "cusp_degree": 27.547428468641016,
                "motion_speed": 0.21359332739797626,
                "zodiac": 4,
                "house": 4,
                "motion": "D"
            },
            "Saturn": {
                "degree": 347.797281568655,
                "cusp_degree": 17.797281568655023,
                "motion_speed": -0.06023756108343531,
                "zodiac": 12,
                "house": 12,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 5.666580245557273,
                "cusp_degree": 5.666580245557273,
                "motion_speed": -0.1343027494474276,
                "zodiac": 1,
                "house": 1,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 6.960346240824412,
                "cusp_degree": 6.960346240824412,
                "motion_speed": -0.052992101951675,
                "zodiac": 1,
                "house": 1,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 186.9603462408244,
                "motion_speed": -0.052992101951675,
                "cusp_degree": 6.960346240824407,
                "zodiac": 7,
                "house": 7,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 185.66658024555727,
                "motion_speed": -0.1343027494474276,
                "cusp_degree": 5.66658024555727,
                "zodiac": 7,
                "house": 7,
                "motion": "R"
            }
        }
    }
}
