{
    "request": {
        "name": "Pope Francis",
        "title": "Pope/Spiritual",
        "year": 1936,
        "month": 12,
        "day": 17,
        "hour": 21,
        "minute": 0,
        "second": 0,
        "latitude": -34.6083696,
        "longitude": -58.4440583,
        "location": "Buenos Aires, Argentina",
        "agyat_rating": "AA",
        "about": "<p>Pope Francis (born Jorge Mario Bergoglio; 17 December 1936 – 21 April 2025) was the head of the Catholic Church and sovereign of the Vatican City State from 2013 until his death in 2025. He was the first pope from the Society of Jesus (the Jesuit Order), the first Latin American, the first from the Americas, the first from the Southern Hemisphere, and the first born or raised outside of Europe since the 8th-century Syrian pope Gregory III.</p><p> Born in Buenos Aires, Argentina, to a family of Italian origin, Bergoglio was inspired to join the Jesuits in 1958 after recovering from a severe illness. He was ordained a Catholic priest in 1969, and from 1973 to 1979 he was the Jesuit provincial superior in Argentina. He became the archbishop of Buenos Aires in 1998 and was created a cardinal in 2001 by Pope John Paul II.</p><p> Following the resignation of Pope Benedict XVI on 28 February 2013, a papal conclave elected Bergoglio as his successor on 13 March. He chose Francis as his papal name in honour of Saint Francis of Assisi. Throughout his public life, Francis was noted for his humility, emphasis on God's mercy, international visibility as pope, concern for the poor, and commitment to interreligious dialogue. He was known for having a less formal approach to the papacy than his predecessors by, for instance, choosing to reside in the Domus Sanctae Marthae (House of St. Martha) guesthouse rather than in the papal apartments of the Apostolic Palace used by previous popes. In addition, due to both his Jesuit and Ignatian aesthetic, he was known for favoring simpler vestments void of ornamentation, including refusing the traditional papal mozzetta cape upon his election, choosing silver instead of gold for his piscatory ring, and keeping the same pectoral cross he had as cardinal. Francis made women full members of dicasteries in the Roman Curia.</p><p> Francis believed that the Catholic Church should be more sympathetic towards LGBTQ people, and stated that although blessings of same-sex unions are not permitted, the individuals in a same-sex relationship can be blessed as long as the blessing is not given in a liturgical context. Francis was a critic of trickle-down economics, consumerism, and overdevelopment; he made action on climate change a leading focus of his papacy. He viewed the death penalty as inadmissible in all cases, and committed the Catholic Church to its worldwide abolition. In international diplomacy, Francis criticized the rise of right-wing populism, called for the decriminalization of homosexuality, helped to restore full diplomatic relations between the United States and Cuba, negotiated a deal with the People's Republic of China to define Communist Party influence in appointing Chinese bishops, and supported the cause of refugees. He encouraged peace between Israel and Palestinians, signed the Vatican's first treaty with the State of Palestine and condemned Israel's military operations in Gaza, calling for investigations of war crimes. He called protection of migrants a \"duty of civilization\" and criticized anti-immigration politics, including those of US president Donald Trump. In 2022, he apologized for the Church's role in the cultural genocide of Canadian Indigenous peoples in residential schools. Francis convened the Synod on Synodality, which was described as the culmination of his papacy and the most important event in the Catholic Church since the Second Vatican Council.</p><p> Francis died at the age of 88 in the early morning of 21 April 2025, on Easter Monday, after suffering a cerebral stroke, which led to a coma and cardiac arrest. He had made his last public appearance the day before, on Easter Sunday.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 91.14245943933639,
            "ascendant": 4
        },
        "planets": {
            "Jupiter": {
                "degree": 250.5664688221097,
                "cusp_degree": 10.566468822109698,
                "motion_speed": 0.22914658800519244,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Sun": {
                "degree": 242.96408765971998,
                "cusp_degree": 2.9640876597199792,
                "motion_speed": 1.0183567124295463,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Moon": {
                "degree": 290.06041402434033,
                "cusp_degree": 20.060414024340332,
                "motion_speed": 13.048991934202816,
                "zodiac": 10,
                "house": 7,
                "motion": "D"
            },
            "Venus": {
                "degree": 284.6717799951294,
                "cusp_degree": 14.671779995129384,
                "motion_speed": 1.1879050241805582,
                "zodiac": 10,
                "house": 7,
                "motion": "D"
            },
            "Mars": {
                "degree": 176.55275276764047,
                "cusp_degree": 26.55275276764047,
                "motion_speed": 0.5681775704360582,
                "zodiac": 6,
                "house": 3,
                "motion": "D"
            },
            "Mercury": {
                "degree": 258.8877395564475,
                "cusp_degree": 18.887739556447514,
                "motion_speed": 1.4994898054147778,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Saturn": {
                "degree": 323.52545419313685,
                "cusp_degree": 23.525454193136852,
                "motion_speed": 0.04964986867593707,
                "zodiac": 11,
                "house": 8,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 241.29832407686072,
                "cusp_degree": 1.2983240768607232,
                "motion_speed": -0.0034844268312976727,
                "zodiac": 9,
                "house": 6,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 241.30070505618687,
                "cusp_degree": 1.300705056186871,
                "motion_speed": -0.05299206531423745,
                "zodiac": 9,
                "house": 6,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 61.30070505618687,
                "motion_speed": -0.05299206531423745,
                "cusp_degree": 1.300705056186871,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 61.298324076860695,
                "motion_speed": -0.0034844268312976727,
                "cusp_degree": 1.2983240768606947,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            }
        }
    }
}
