{
    "request": {
        "name": "Queen Elizabeth II",
        "title": "Monarch",
        "year": 1926,
        "month": 4,
        "day": 21,
        "hour": 2,
        "minute": 0,
        "second": 0,
        "latitude": 51.5074456,
        "longitude": -0.1277653,
        "location": "Buckingham Palace, London",
        "agyat_rating": "AA",
        "advanced": "long-term-career",
        "about": "<p>Elizabeth II (Elizabeth Alexandra Mary; 21 April 1926 – 8 September 2022) was Queen of the United Kingdom and other Commonwealth realms from 6 February 1952 until her death in 2022. She had been queen regnant of 32 sovereign states during her lifetime and was the monarch of 15 realms at her death. Her reign of 70 years and 214 days is the longest of any British monarch, the second-longest of any sovereign state, and the longest of any queen regnant in history.</p><p> Elizabeth was born in Mayfair, London, during the reign of her paternal grandfather, King George V. She was the first child of the Duke and Duchess of York (later King George VI and Queen Elizabeth The Queen Mother). Her father acceded to the throne in 1936 upon the abdication of his brother Edward VIII, making the ten-year-old Princess Elizabeth the heir presumptive. She was educated privately at home and began to undertake public duties during the Second World War, serving in the Auxiliary Territorial Service. In November 1947, she married Philip Mountbatten, a former prince of Greece and Denmark. Their marriage lasted 73 years until his death in 2021. They had four children: Charles, Anne, Andrew, and Edward.</p><p> When her father died in February 1952, Elizabeth, then 25 years old, became queen of seven independent Commonwealth countries: the United Kingdom, Canada, Australia, New Zealand, South Africa, Pakistan, and Ceylon, as well as head of the Commonwealth. Elizabeth reigned as a constitutional monarch through major political changes such as the Troubles in Northern Ireland, devolution in the United Kingdom, the decolonisation of Africa, and the United Kingdom's accession to the European Communities as well as its subsequent withdrawal. The number of her realms varied over time as territories gained independence and some realms became republics. As queen, Elizabeth was served by more than 170 prime ministers across her realms. Her many historic visits and meetings included state visits to China in 1986, to Russia in 1994, and to the Republic of Ireland in 2011, and meetings with five popes and fourteen US presidents.</p><p> Significant events included Elizabeth's coronation in 1953 and the celebrations of her Silver, Golden, Diamond, and Platinum jubilees. Although there was occasional republican sentiment and media criticism of her family—particularly after the breakdowns of her children's marriages, her annus horribilis in 1992, and the death in 1997 of her former daughter-in-law Diana—support for the monarchy and her personal popularity in the United Kingdom remained consistently high. Elizabeth died aged 96 at Balmoral Castle, and was succeeded by her eldest son, Charles III.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 275.538295475639,
            "ascendant": 10
        },
        "planets": {
            "Sun": {
                "degree": 7.397120880692808,
                "cusp_degree": 7.397120880692808,
                "motion_speed": 0.9755038032314953,
                "zodiac": 1,
                "house": 4,
                "motion": "D"
            },
            "Moon": {
                "degree": 109.47101899613078,
                "cusp_degree": 19.47101899613078,
                "motion_speed": 11.813912479176754,
                "zodiac": 4,
                "house": 7,
                "motion": "D"
            },
            "Mercury": {
                "degree": 341.8472561544718,
                "cusp_degree": 11.84725615447178,
                "motion_speed": 0.5622822467067113,
                "zodiac": 12,
                "house": 3,
                "motion": "D"
            },
            "Venus": {
                "degree": 321.14746857121514,
                "cusp_degree": 21.147468571215143,
                "motion_speed": 0.990578849784737,
                "zodiac": 11,
                "house": 2,
                "motion": "D"
            },
            "Mars": {
                "degree": 298.05368963067224,
                "cusp_degree": 28.05368963067224,
                "motion_speed": 0.7231500855636463,
                "zodiac": 10,
                "house": 1,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 299.68883428066067,
                "cusp_degree": 29.68883428066067,
                "motion_speed": 0.15352094708054875,
                "zodiac": 10,
                "house": 1,
                "motion": "D"
            },
            "Saturn": {
                "degree": 211.62108448644395,
                "cusp_degree": 1.621084486443948,
                "motion_speed": -0.06469890597378646,
                "zodiac": 8,
                "house": 11,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 87.2891396916773,
                "cusp_degree": 27.289139691677306,
                "motion_speed": -0.018995139615519057,
                "zodiac": 3,
                "house": 6,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 87.64940211095204,
                "cusp_degree": 27.64940211095204,
                "motion_speed": -0.05299207568611088,
                "zodiac": 3,
                "house": 6,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 267.64940211095205,
                "motion_speed": -0.05299207568611088,
                "cusp_degree": 27.649402110952053,
                "zodiac": 9,
                "house": 12,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 267.2891396916773,
                "motion_speed": -0.018995139615519057,
                "cusp_degree": 27.289139691677292,
                "zodiac": 9,
                "house": 12,
                "motion": "R"
            }
        }
    }
}
