{
    "request": {
        "name": "Rajiv Gandhi (Politician)",
        "year": 1944,
        "month": 8,
        "day": 20,
        "hour": 7,
        "minute": 11,
        "second": 0,
        "latitude": 19.054999,
        "longitude": 72.8692035,
        "location": "Mumbai, Maharashtra",
        "agyat_rating": "AA",
        "about": "Rajiv Gandhi (20 August 1944 – 21 May 1991) was an Indian statesman and pilot who served as the prime minister of India from 1984 to 1989. He took office after the assassination of his mother, then–prime minister Indira Gandhi, to become at the age of 40 the youngest Indian prime minister. He served until his defeat at the 1989 election, and then became Leader of the Opposition, Lok Sabha, resigning in December 1990, six months before his own assassination.\n Gandhi was not related to Mahatma Gandhi. Instead, he was from the politically powerful Nehru–Gandhi family, which had been associated with the Indian National Congress party. For much of his childhood, his maternal grandfather Jawaharlal Nehru was prime minister. Gandhi attended The Doon School, an elite boarding institution, and then the University of Cambridge in the United Kingdom. He returned to India in 1966 and became a professional pilot for the state-owned Indian Airlines. In 1968, he married Sonia Maino; the couple settled in Delhi for a domestic life with their children Rahul and Priyanka. For much of the 1970s, his mother was prime minister and his younger brother Sanjay an MP; despite this, Gandhi remained apolitical.\n After Sanjay died in a plane crash in 1980, Gandhi reluctantly entered politics at the behest of his mother. The following year he won his brother's Parliamentary seat of Amethi and became a member of the Lok Sabha, the lower house of India's Parliament. As part of his political grooming, Rajiv was made general secretary of the Congress party and given significant responsibility in organising the 1982 Asian Games.\n On the morning of 31 October 1984, his mother (the then prime minister) was assassinated by her two Sikh bodyguards Satwant Singh and Beant Singh in the aftermath of Operation Blue Star, an Indian military action to remove Sikh separatist activists from the Golden Temple. Later that day, Gandhi was appointed prime minister. His leadership was tested over the next few days as organised mobs rioted against the Sikh community, resulting in anti-Sikh massacres in Delhi. That December, the Congress party won the largest Lok Sabha majority to date, 414 seats out of 541. Gandhi's period in office was mired in controversies such as Bhopal disaster, Bofors scandal and Mohd. Ahmed Khan v. Shah Bano Begum. In 1988, he reversed the coup in Maldives, antagonising militant Tamil groups such as PLOTE, intervening and then sending peacekeeping troops to Sri Lanka in 1987, leading to open conflict with the Liberation Tigers of Tamil Eelam (LTTE). His party was defeated in the 1989 election.\n Gandhi remained Congress president until the elections in 1991. While campaigning for the elections, he was assassinated by a suicide bomber from the LTTE. In 1991, the Indian government posthumously awarded Gandhi the Bharat Ratna, the country's highest civilian award. At the India Leadership Conclave in 2009, the Revolutionary Leader of Modern India award was conferred posthumously on Gandhi."
    },
    "response": {
        "ascendant": {
            "asc_deg": 129.39054781649645,
            "ascendant": 5
        },
        "planets": {
            "Jupiter": {
                "degree": 132.20033009938481,
                "cusp_degree": 12.200330099384814,
                "motion_speed": 0.21594029712560153,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Sun": {
                "degree": 123.80943120325851,
                "cusp_degree": 3.8094312032585123,
                "motion_speed": 0.9631659780485176,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Moon": {
                "degree": 136.9692164824577,
                "cusp_degree": 16.96921648245771,
                "motion_speed": 11.859227213805118,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Venus": {
                "degree": 138.63795885392875,
                "cusp_degree": 18.63795885392875,
                "motion_speed": 1.23304332592356,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Mars": {
                "degree": 151.18916536023144,
                "cusp_degree": 1.189165360231442,
                "motion_speed": 0.6364211887657883,
                "zodiac": 6,
                "house": 2,
                "motion": "D"
            },
            "Mercury": {
                "degree": 148.5668260053728,
                "cusp_degree": 28.566826005372803,
                "motion_speed": 0.37227214608574727,
                "zodiac": 5,
                "house": 1,
                "motion": "D"
            },
            "Saturn": {
                "degree": 74.21821707113608,
                "cusp_degree": 14.218217071136081,
                "motion_speed": 0.09938881550367096,
                "zodiac": 3,
                "house": 11,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 94.40569133175933,
                "cusp_degree": 4.4056913317593285,
                "motion_speed": -0.07715420797711652,
                "zodiac": 4,
                "house": 12,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 92.81604332476418,
                "cusp_degree": 2.8160433247641805,
                "motion_speed": -0.05299205800365266,
                "zodiac": 4,
                "house": 12,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 272.81604332476417,
                "motion_speed": -0.05299205800365266,
                "cusp_degree": 2.8160433247641663,
                "zodiac": 10,
                "house": 6,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 274.40569133175933,
                "motion_speed": -0.07715420797711652,
                "cusp_degree": 4.4056913317593285,
                "zodiac": 10,
                "house": 6,
                "motion": "R"
            }
        }
    }
}
