{
    "request": {
        "name": "Ramkrishna Dalmia",
        "title": "Businessperson",
        "year": 1893,
        "month": 4,
        "day": 7,
        "hour": 11,
        "minute": 9,
        "second": 0,
        "latitude": 28.12559,
        "longitude": 75.39797,
        "location": "Chirawa",
        "agyat_rating": "AA",
        "advanced": "legal-troubles, detention",
        "about": "<p>The Dalmia Group of companies traces its origins to Ramkrishna Dalmia and Jaidayal Dalmia. The two brothers were born in Jhunjhunu, Rajasthan. The name Dalmia comes from the name of their ancestral village in present-day Haryana. The Dalmias established a group of businesses in East India during the first half of the 20th century. These businesses included a sugar mill in Danapur and a commodity trading business in Calcutta. In 1932, Ramkrishna's daughter married Shanti Prasad Jain of the wealthy Sahu Jain family. Subsequently, Shanti Prasad and the Dalmia brothers worked together to expand the business, resulting in the formation of the Dalmia-Jain Group. By the end of 1940, the group was operating several sugar mills, cement plants, chemical factories, engineering plants and a paper mill.</p><p>The Dalmia-Jain Group challenged ACC's monopoly in the Indian cement industry by setting up cement factories all over India (including present-day Pakistan). It also ventured into other businesses; its subsidiaries included Bharat Bank, Bharat Fire and General Insurance, Lahore Electric, Govan group of companies, two cotton mills, a dairy, and three Andrew Yule jute mills.[2] In 1946, Ramkrishna Dalmia bought out Bennett, Coleman & Co. Ltd., the publisher of The Times of India; which was later sold to the Jains after a split in the Dalmia-Jain Group.</p><p>By 1948, differences had developed between the Dalmias and the Jains. On 12 May 1948, the two families worked out the details of a split at the family house of the Jains in Mussoorie.[1] On 31 May 1948, the Dalmia-Jain Group was dissolved, splitting into what were colloquially known as Dalmia Group (divided between Ramkrishna and his brother Jaidayal) and Sahu Jain Group.[3] However, this split was not official: there was no legal document to this effect.[2] Vivian Bose remarked that the Dalmia-Jain Group's affairs \"were so interlocked and complex because of black money and secret, undisclosed assets and undetermined income tax liabilities, that this (dissolution or partition) was not found to be easy\".</p><p>After the split, Jaidayal Dalmia gained control of Dalmia Cement (Bharat) Ltd., established in 1939 and Orissa Cement Ltd., established in 1949. Later, his sons Jai Hari Dalmia and Yadu Hari Dalmia took control of Dalmia Cement. Three other sons, Ajay Hari Dalmia, Mridu Hari Dalmia and Raghu Hari Dalmia - took over the Orissa Cement business. In 1999, Ajay Hari Dalmia separated from Orissa Cement, and started his own line of businesses under the name Renaissance Group.</p><p>In 1956, the Government of India set up a Commission of Inquiry to investigate alleged malpractices of the Dalmia-Jain Group of companies. The Commission was headed by Justice S. R. Tendolkar (and after his death, by Justice Vivian Bose).[1] In 1962, Ramkrishna Dalmia was jailed for tax evasion, perjury and criminal misappropriation of funds. By the time he died in 1978, he had 17 children from 6 wives. These heirs fought several court cases for control of the various businesses owned by him.[4] In 1983, these businesses were divided among his seven sons.</p>",
        "related": ["dalmia-family"]
    },
    "response": {
        "ascendant": {
            "asc_deg": 70.81873137334702,
            "ascendant": 3
        },
        "planets": {
            "Jupiter": {
                "degree": 10.595097785745477,
                "cusp_degree": 10.595097785745477,
                "motion_speed": 0.23561820021268118,
                "zodiac": 1,
                "house": 11,
                "motion": "D"
            },
            "Sun": {
                "degree": 355.24696471669864,
                "cusp_degree": 25.246964716698642,
                "motion_speed": 0.9821594523640165,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 240.18702002651767,
                "cusp_degree": 0.18702002651767202,
                "motion_speed": 11.879531908846722,
                "zodiac": 9,
                "house": 7,
                "motion": "D"
            },
            "Venus": {
                "degree": 348.68726550867206,
                "cusp_degree": 18.687265508672056,
                "motion_speed": 1.23855762363058,
                "zodiac": 12,
                "house": 10,
                "motion": "D"
            },
            "Mars": {
                "degree": 43.79923048522701,
                "cusp_degree": 13.799230485227007,
                "motion_speed": 0.6517390684386103,
                "zodiac": 2,
                "house": 12,
                "motion": "D"
            },
            "Mercury": {
                "degree": 344.55609351226053,
                "cusp_degree": 14.556093512260531,
                "motion_speed": -0.6231505676719066,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            },
            "Saturn": {
                "degree": 166.44895957956038,
                "cusp_degree": 16.44895957956038,
                "motion_speed": -0.07660158108444236,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 6.406999736142621,
                "cusp_degree": 6.406999736142621,
                "motion_speed": 0.016107013741380054,
                "zodiac": 1,
                "house": 11,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 7.044902137770711,
                "cusp_degree": 7.044902137770711,
                "motion_speed": -0.0529921240209852,
                "zodiac": 1,
                "house": 11,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 187.04490213777072,
                "motion_speed": -0.0529921240209852,
                "cusp_degree": 7.04490213777072,
                "zodiac": 7,
                "house": 5,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 186.4069997361426,
                "motion_speed": 0.016107013741380054,
                "cusp_degree": 6.406999736142609,
                "zodiac": 7,
                "house": 5,
                "motion": "R"
            }
        }
    }
}
