{
    "request": {
        "name": "Ravichandran Ashwin",
        "title": "Sportsperson",
        "year": 1986,
        "month": 9,
        "day": 17,
        "hour": 12,
        "minute": 39,
        "second": 0,
        "latitude": 13.0836939,
        "longitude": 80.270186,
        "location": "Chennai, Tamilnadu",
        "agyat_rating": "AA",
        "about": "Ravichandran Ashwin (Tamil: [ɾaʋitɕand̪iɾan aɕʋin]; pronunciation) (born 17 September 1986) is an Indian cricketer. He is a right-arm off spin bowler and a lower order batter. Widely regarded as one of the most prolific spinners of all time, he represented the Indian cricket team and was part of the Indian team that won the 2011 Cricket World Cup and the 2013 Champions Trophy. He plays for Tamil Nadu and South Zone in domestic cricket and for Chennai Super Kings in the Indian Premier League (IPL).\n Ashwin has taken more than 500 wickets in Tests and was the fastest bowler to reach 300 test wickets in terms of number of innings. He has won eleven Man of the Series awards in Tests, which is the most for any cricketer, along with Muttiah Muralitharan. As an all-rounder in Test cricket, he bats down the order, has scored six Test centuries and is one of the only three players to have scored 3000 runs and taken 500 wickets in Tests. He had been the highest-ranked bowler in the ICC men's player rankings multiple times, and holds the record for the second highest rating points by an Indian bowler ever in Test cricket.\n Ashwin started as an opening batsman but dropped down the order due to limited success and turned into an off-break bowler. He made his first-class debut for Tamil Nadu in December 2006 and captained the team the following season. He played for the Chennai Super Kings (CSK) in the 2010 Indian Premier League, where his economical bowling led to his maiden international call-up in the limited-overs formats in June 2010. He was the leading wicket-taker and player of the tournament of the 2010 Champions League Twenty20, which was won by CSK. He also won the 2014 Champions League Twenty20 and two IPL titles (2010, 2011) with CSK.\n In 2011, Ashwin made his Test debut against West Indies and became the seventh Indian bowler to take a five-wicket haul on debut. He had greater success with the turning tracks in the Indian subcontinent, including taking 29 wickets in a series against Australia, the most by any Indian bowler in a four-match Test series. In the 2015–16 season, he took 48 wickets and scored 336 runs in eight Test matches, along with 27 wickets in 19 T20Is, enabling him to win the ICC Cricketer of the Year and ICC Men's Test Cricketer of the Year awards for 2016. He has been named five times to the ICC Men's Test Team of the Year and was named in the ICC Men's Test Team of the Decade 2011–20. In 2015, he was awarded the Arjuna award by the Government of India. On 18 December 2024, Ashwin announced his retirement from all forms of international cricket. He was awarded Padma Shri, the fourth highest civilian award, by the Government of India in January 2025."
    },
    "response": {
        "ascendant": {
            "asc_deg": 244.19092901150887,
            "ascendant": 9
        },
        "planets": {
            "Sun": {
                "degree": 150.43540848089688,
                "cusp_degree": 0.4354084808968821,
                "motion_speed": 0.9751564804065207,
                "zodiac": 6,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 318.7488862467638,
                "cusp_degree": 18.74888624676379,
                "motion_speed": 13.618964497492442,
                "zodiac": 11,
                "house": 3,
                "motion": "D"
            },
            "Mercury": {
                "degree": 160.11369547785637,
                "cusp_degree": 10.113695477856368,
                "motion_speed": 1.7039977655483478,
                "zodiac": 6,
                "house": 10,
                "motion": "D"
            },
            "Venus": {
                "degree": 194.35647212672458,
                "cusp_degree": 14.356472126724583,
                "motion_speed": 0.7479967383501812,
                "zodiac": 7,
                "house": 11,
                "motion": "D"
            },
            "Mars": {
                "degree": 265.8153108853633,
                "cusp_degree": 25.815310885363317,
                "motion_speed": 0.4102403376556551,
                "zodiac": 9,
                "house": 1,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 323.34496284131586,
                "cusp_degree": 23.344962841315862,
                "motion_speed": -0.13067006760779803,
                "zodiac": 11,
                "house": 3,
                "motion": "R"
            },
            "Saturn": {
                "degree": 220.7278559927882,
                "cusp_degree": 10.727855992788193,
                "motion_speed": 0.06290118997934192,
                "zodiac": 8,
                "house": 12,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 357.35008458841355,
                "cusp_degree": 27.35008458841355,
                "motion_speed": -0.0580121799330938,
                "zodiac": 12,
                "house": 4,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 358.42139045873313,
                "cusp_degree": 28.42139045873313,
                "motion_speed": -0.05299203394732502,
                "zodiac": 12,
                "house": 4,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 178.42139045873319,
                "motion_speed": -0.05299203394732502,
                "cusp_degree": 28.421390458733185,
                "zodiac": 6,
                "house": 10,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 177.35008458841355,
                "motion_speed": -0.0580121799330938,
                "cusp_degree": 27.35008458841355,
                "zodiac": 6,
                "house": 10,
                "motion": "R"
            }
        }
    }
}
