{
    "request": {
        "name": "Rohit Sharma",
        "title": "Sportsperson",
        "year": 1987,
        "month": 4,
        "day": 29,
        "hour": 14,
        "minute": 58,
        "second": 0,
        "latitude": 21.1498134,
        "longitude": 79.0820556,
        "location": "Nagpur, Maharashtra",
        "agyat_rating": "AA",
        "about": "Rohit Gurunath Sharma (born 30 April 1987) is an Indian international cricketer and the captain of Indian cricket team in Test and ODI formats. He is widely regarded as one of the greatest ODI opening batters of all time. He is a right-handed batsman who plays for Mumbai Indians in Indian Premier League and for Mumbai in domestic cricket. Rohit previously captained India in all three formats. After leading India to the victory at the 2024 Men's T20 World Cup, he announced his retirement from T20Is. He also led India to victory in the 2025 ICC Champions Trophy.\n He holds several batting records which famously include most runs in T20 Internationals, most sixes in international cricket, most double centuries in ODI cricket (3), most centuries at Cricket World Cups (7) and joint most hundreds in Twenty20 Internationals (5).He also holds the world record for the highest individual score (264) in a One Day International (ODI) and also holds the record for scoring most hundreds (five) in a single Cricket World Cup, for which he won the ICC Men's ODI Cricketer of the Year award in 2019. He is the first and only captain to lead a team in all ICC tournament finals.\n He plays for Mumbai Indians and Mumbai cricket team in Indian Premier League (IPL) and domestic cricket respectively. He formerly captained Mumbai Indians and the team has won 5 Indian Premier League titles in 2013, 2015, 2017, 2019 and 2020 under him, making him the most successful captain in IPL history, sharing this record with MS Dhoni. With India, Rohit Sharma was a member of the team that won the 2007 T20 World Cup, and the 2013 ICC Champions Trophy, where he played in the finals of both tournaments. He is also one of two players who have played in every edition of the T20 World Cup, from the inaugural edition in 2007 to the latest one in 2024. He is the only Indian player to win two T20 World Cups. He became the second Indian captain to win a T20 World Cup, when he led India to win the 2024 T20 World Cup.\n He has received two national honours, the Arjuna Award in 2015 and the prestigious Khel Ratna Award in 2020 by the Government of India. Under his captaincy, India won the 2018 Asia Cup and the 2023 Asia Cup, the seventh and eighth time the country won the title, both in ODI format as well as the 2018 Nidahas Trophy, their second overall and first in T20I format."
    },
    "response": {
        "ascendant": {
            "asc_deg": 139.68200418728003,
            "ascendant": 5
        },
        "planets": {
            "Sun": {
                "degree": 14.85139085698486,
                "cusp_degree": 14.85139085698486,
                "motion_speed": 0.9721414598091072,
                "zodiac": 1,
                "house": 9,
                "motion": "D"
            },
            "Moon": {
                "degree": 30.259233155822855,
                "cusp_degree": 0.2592331558228551,
                "motion_speed": 12.560354576039577,
                "zodiac": 2,
                "house": 10,
                "motion": "D"
            },
            "Mercury": {
                "degree": 5.771097337420693,
                "cusp_degree": 5.771097337420693,
                "motion_speed": 2.00669362531412,
                "zodiac": 1,
                "house": 9,
                "motion": "D"
            },
            "Venus": {
                "degree": 344.4133455831174,
                "cusp_degree": 14.413345583117405,
                "motion_speed": 1.2073741359634422,
                "zodiac": 12,
                "house": 8,
                "motion": "D"
            },
            "Mars": {
                "degree": 52.071144183534855,
                "cusp_degree": 22.071144183534855,
                "motion_speed": 0.6598232829566614,
                "zodiac": 2,
                "house": 10,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 350.0898425840511,
                "cusp_degree": 20.089842584051098,
                "motion_speed": 0.23036581411722964,
                "zodiac": 12,
                "house": 8,
                "motion": "D"
            },
            "Saturn": {
                "degree": 236.805700509924,
                "cusp_degree": 26.80570050992401,
                "motion_speed": -0.04492759094513102,
                "zodiac": 8,
                "house": 4,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 347.68323229027527,
                "cusp_degree": 17.68323229027527,
                "motion_speed": -0.06803629837956642,
                "zodiac": 12,
                "house": 8,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 346.5469081956676,
                "cusp_degree": 16.546908195667584,
                "motion_speed": -0.05299203334856759,
                "zodiac": 12,
                "house": 8,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 166.54690819566758,
                "motion_speed": -0.05299203334856759,
                "cusp_degree": 16.546908195667584,
                "zodiac": 6,
                "house": 2,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 167.68323229027533,
                "motion_speed": -0.06803629837956642,
                "cusp_degree": 17.683232290275328,
                "zodiac": 6,
                "house": 2,
                "motion": "R"
            }
        }
    }
}
