{
    "request": {
        "name": "Sachin Tendulkar",
        "title": "Sportsperson",
        "year": 1973,
        "month": 4,
        "day": 24,
        "hour": 12,
        "minute": 54,
        "second": 0,
        "latitude": 19.054999,
        "longitude": 72.8692035,
        "location": "Mumbai, Maharashtra",
        "agyat_rating": "AA",
        "about": "<p>Sachin Ramesh Tendulkar (/ˌsʌtʃɪn tɛnˈduːlkər/; Marathi: [sətɕin t̪eɳɖulkəɾ]; born 24 April 1973) is an Indian former international cricketer who captained the Indian national team. He is widely regarded as one of the greatest cricketers of all time, and is the holder of several world records, including being the all-time highest run-scorer in both ODI and Test cricket, receiving the most player of the match awards in international cricket, and being the only batsman to score 100 international centuries. Tendulkar was a Member of Parliament, Rajya Sabha by presidential nomination from 2012 to 2018.</p><p> Tendulkar took up cricket at the age of eleven, made his Test match debut on 15 November 1989 against Pakistan in Karachi at the age of sixteen, and went on to represent Mumbai domestically and India internationally for over 24 years. In 2002, halfway through his career, Wisden ranked him the second-greatest Test batsman of all time, behind Don Bradman, and the second-greatest ODI batsman of all time, behind Viv Richards. The same year, Tendulkar was a part of the team that was one of the joint-winners of the 2002 ICC Champions Trophy. Later in his career, Tendulkar was part of the Indian team that won the 2011 Cricket World Cup, his first win in six World Cup appearances for India. He had previously been named \"Player of the Tournament\" at the 2003 World Cup.</p><p> Tendulkar has received several awards from the government of India: the Arjuna Award (1994), the Khel Ratna Award (1997), the Padma Shri (1998), and the Padma Vibhushan (2008). After Tendulkar played his last match in November 2013, the Prime Minister's Office announced the decision to award him the Bharat Ratna, India's highest civilian award. He was the first sportsperson to receive the award and, as of 2024, is the youngest recipient. In 2010, Time included Tendulkar in its annual list of the most influential people in the world. Tendulkar was awarded the Sir Garfield Sobers Trophy for cricketer of the year at the 2010 International Cricket Council (ICC) Awards.</p><p> Having retired from ODI cricket in 2012, he retired from all forms of cricket in November 2013 after playing his 200th Test match. Tendulkar played 664 international cricket matches in total, scoring 34,357 runs. In 2013, Tendulkar was included in an all-time Test World XI to mark the 150th anniversary of Wisden Cricketers' Almanack, and he was one of only two specialist batsmen of the post–World War II era, along with Viv Richards, to get featured in the team. In 2019, he was inducted into the ICC Cricket Hall of Fame.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 101.31111041113888,
            "ascendant": 4
        },
        "planets": {
            "Sun": {
                "degree": 10.472002290461699,
                "cusp_degree": 10.472002290461699,
                "motion_speed": 0.9738415913937937,
                "zodiac": 1,
                "house": 10,
                "motion": "D"
            },
            "Moon": {
                "degree": 264.35603461337837,
                "cusp_degree": 24.35603461337837,
                "motion_speed": 11.903332453527614,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Mercury": {
                "degree": 346.69464183874663,
                "cusp_degree": 16.694641838746634,
                "motion_speed": 1.4949300472675293,
                "zodiac": 12,
                "house": 9,
                "motion": "D"
            },
            "Venus": {
                "degree": 14.232517998787628,
                "cusp_degree": 14.232517998787628,
                "motion_speed": 1.2351351030117106,
                "zodiac": 1,
                "house": 10,
                "motion": "D"
            },
            "Mars": {
                "degree": 296.687993485483,
                "cusp_degree": 26.68799348548299,
                "motion_speed": 0.7095759521135682,
                "zodiac": 10,
                "house": 7,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 286.5919960041744,
                "cusp_degree": 16.591996004174405,
                "motion_speed": 0.10787793690658835,
                "zodiac": 10,
                "house": 7,
                "motion": "D"
            },
            "Saturn": {
                "degree": 54.25712396875125,
                "cusp_degree": 24.25712396875125,
                "motion_speed": 0.1060801788394034,
                "zodiac": 2,
                "house": 11,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 256.3882835985759,
                "cusp_degree": 16.388283598575924,
                "motion_speed": 0.008486546348518243,
                "zodiac": 9,
                "house": 6,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 257.76468844546224,
                "cusp_degree": 17.76468844546224,
                "motion_speed": -0.05299204689531641,
                "zodiac": 9,
                "house": 6,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 77.76468844546224,
                "motion_speed": -0.05299204689531641,
                "cusp_degree": 17.76468844546224,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 76.38828359857592,
                "motion_speed": 0.008486546348518243,
                "cusp_degree": 16.388283598575924,
                "zodiac": 3,
                "house": 12,
                "motion": "R"
            }
        }
    }
}
