{
    "request": {
        "name": "Sam Manekshaw",
        "title": "Army General, Field Marshal, Chief of the Army Staff",
        "year": 1914,
        "month": 4,
        "day": 3,
        "hour": 16,
        "minute": 30,
        "second": 0,
        "latitude": 31.62234,
        "longitude": 74.87534,
        "location": "Amritsar",
        "agyat_rating": "AA",
        "advanced": "long-term-career, fame, death by illness",
        "dod": "27/06/2008",
        "about": "<p>Field Marshal Sam Hormusji Framji Jamshedji Manekshaw MC (3 April 1914 – 27 June 2008), also known as Sam Bahadur (\"the Brave\") was an Indian Army general officer who was the Chief of the army staff during the Bangladesh Liberation War in 1971, and the first Indian army officer to be promoted to the rank of field marshal. His active military career spanned four decades, beginning with service in World War II.</p><p>Manekshaw joined the first intake of the Indian Military Academy at Dehradun in 1932. He was commissioned into the 4th Battalion, 12th Frontier Force Regiment. In World War II, he was awarded the Military Cross for gallantry. Following the Partition of India in 1947, he was reassigned to the 8th Gorkha Rifles. Manekshaw was seconded to a planning role during the 1947 Indo-Pakistani War and the Hyderabad crisis, and as a result, he never commanded an infantry battalion. He was promoted to the rank of brigadier while serving at the Military Operations Directorate. He became the commander of 167 Infantry Brigade in 1952 and served in this position until 1954 when he took over as the director of military training at the Army Headquarters.</p><p>After completing the higher command course at the Imperial Defence College, he was appointed the general officer commanding of the 26th Infantry Division. He also served as the commandant of the Defence Services Staff College. In 1962, he was accused in a politically motivated treason trial, he was eventually found innocent but thus could not serve in the 1962 war. In 1963, Manekshaw was promoted to the rank of army commander and took over Western Command, then was transferred in 1964 to Eastern Command. In this role, in 1967, he was involved in the first Indian victory against a Chinese offensive during the Nathu La and Cho La clashes.</p><p>Manekshaw was awarded the Padma Bhushan, the third highest Indian civilian award, in 1968 for responding to the insurgencies in Nagaland and Mizoram. Manekshaw became the seventh chief of army staff in 1969. Under his command, Indian forces providing them with arms and ammunitions to fight against the strong regular army of Pakistan in the Bangladesh-Pakistani War of 1971, which led to the creation of Bangladesh in December 1971. He was awarded the Padma Vibhushan, the second highest civilian award of India, in 1972 for his services to the nation. Manekshaw was promoted to the rank of field marshal in January 1973, the first of the only two officers to be ever promoted to the post, second being K.M. Carriappa. He retired on 15 January 1973 (also celebrated as Army Day). He died on 27 June 2008, at the age of 94, due to respiratory problems.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 135.99882696613065,
            "ascendant": 5
        },
        "planets": {
            "Jupiter": {
                "degree": 292.89099215158774,
                "cusp_degree": 22.89099215158774,
                "motion_speed": 0.17691327248992664,
                "zodiac": 10,
                "house": 6,
                "motion": "D"
            },
            "Sun": {
                "degree": 350.1756056339855,
                "cusp_degree": 20.175605633985526,
                "motion_speed": 0.9852091242648912,
                "zodiac": 12,
                "house": 8,
                "motion": "D"
            },
            "Moon": {
                "degree": 75.66024198122506,
                "cusp_degree": 15.660241981225056,
                "motion_speed": 12.874769706648037,
                "zodiac": 3,
                "house": 11,
                "motion": "D"
            },
            "Venus": {
                "degree": 2.693035129466395,
                "cusp_degree": 2.693035129466395,
                "motion_speed": 1.23730930600418,
                "zodiac": 1,
                "house": 9,
                "motion": "D"
            },
            "Mars": {
                "degree": 84.57012338191608,
                "cusp_degree": 24.570123381916076,
                "motion_speed": 0.39841552550575393,
                "zodiac": 3,
                "house": 11,
                "motion": "D"
            },
            "Mercury": {
                "degree": 322.8072961755041,
                "cusp_degree": 22.80729617550412,
                "motion_speed": 0.791657265490008,
                "zodiac": 11,
                "house": 7,
                "motion": "D"
            },
            "Saturn": {
                "degree": 50.82818347821489,
                "cusp_degree": 20.82818347821489,
                "motion_speed": 0.0847683293102778,
                "zodiac": 2,
                "house": 10,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 321.87941216871644,
                "cusp_degree": 21.879412168716442,
                "motion_speed": -0.00766208005980271,
                "zodiac": 11,
                "house": 7,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 320.84858682342247,
                "cusp_degree": 20.848586823422465,
                "motion_speed": -0.0529920210384147,
                "zodiac": 11,
                "house": 7,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 140.84858682342247,
                "motion_speed": -0.0529920210384147,
                "cusp_degree": 20.848586823422465,
                "zodiac": 5,
                "house": 1,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 141.87941216871644,
                "motion_speed": -0.00766208005980271,
                "cusp_degree": 21.879412168716442,
                "zodiac": 5,
                "house": 1,
                "motion": "R"
            }
        }
    }
}
