{
    "request": {
        "name": "Shah Rukh Khan ",
        "title": "Actor",
        "year": 1965,
        "month": 11,
        "day": 2,
        "hour": 2,
        "minute": 30,
        "second": 0,
        "latitude": 28.6273928,
        "longitude": 77.1716954,
        "location": "Delhi",
        "agyat_rating": "AA",
        "about": "<p>Shah Rukh Khan (pronounced [ˈʃaːɦɾʊx xäːn] ⓘ; born 2 November 1965), also known by the initialism SRK, is an Indian actor and film producer who works in Hindi cinema. Referred to in the media as the \"Baadshah of Bollywood\" and \"King Khan\", he has appeared in more than 100 films, and earned numerous accolades, including 14 Filmfare Awards. He has been awarded the Padma Shri by the Government of India, as well as the Order of Arts and Letters and Legion of Honour by the Government of France. Khan has a significant following in Asia and the Indian diaspora worldwide. In terms of audience size and income, several media outlets have described him as one of the most successful film stars in the world. Many of his films thematise Indian national identity and connections with diaspora communities, or gender, racial, social and religious differences and grievances.</p><p>Khan began his career with appearances in several television series in the late 1980s and made his Bollywood debut in 1992 with the musical romance Deewana. He was initially recognised for playing villainous roles in the films Baazigar (1993) and Darr (1993). Khan established himself by starring in a series of top-grossing romantic films, including Dilwale Dulhania Le Jayenge (1995), Dil To Pagal Hai (1997), Kuch Kuch Hota Hai (1998), Mohabbatein (2000), Kabhi Khushi Kabhie Gham... (2001), Kal Ho Naa Ho (2003), Veer-Zaara (2004) and Kabhi Alvida Naa Kehna (2006). He earned critical acclaim for his portrayal of an alcoholic in the period romantic drama Devdas (2002), a NASA scientist in the social drama Swades (2004), a hockey coach in the sports drama Chak De! India (2007), and a man with Asperger syndrome in the drama My Name Is Khan (2010). Further commercial successes came with the romances Om Shanti Om (2007) and Rab Ne Bana Di Jodi (2008), and with his expansion to comedies in Chennai Express (2013) and Happy New Year (2014). Following a brief setback and hiatus, Khan made a career comeback with the 2023 action thrillers Pathaan and Jawan, both of which rank among the highest-grossing Indian films.</p><p>As of 2015, Khan is co-chairman of the motion picture production company Red Chillies Entertainment and its subsidiaries and is the co-owner of the Indian Premier League cricket team Kolkata Knight Riders and the Caribbean Premier League team Trinbago Knight Riders. The media often label him as \"Brand SRK\" because of his many endorsements and entrepreneurship ventures. He is a frequent television presenter and stage show performer. Khan's philanthropic endeavours have provided health care and disaster relief, and he was honoured with UNESCO's Pyramide con Marni award in 2011 for his support of children's education and the World Economic Forum's Crystal Award in 2018 for advocating for women's and children's rights in India. He regularly features in listings of the most influential people in Indian culture, and in 2008, Newsweek named him one of their fifty most powerful people in the world. In 2022, Khan was voted one of the 50 greatest actors of all time in a readers' poll by Empire, and in 2023, Time named him as one of the most influential people in the world.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 136.84800636631857,
            "ascendant": 5
        },
        "planets": {
            "Jupiter": {
                "degree": 67.65476357694898,
                "cusp_degree": 7.65476357694898,
                "motion_speed": -0.0436916116734338,
                "zodiac": 3,
                "house": 11,
                "motion": "R"
            },
            "Sun": {
                "degree": 195.84163817178904,
                "cusp_degree": 15.841638171789043,
                "motion_speed": 1.000960071817041,
                "zodiac": 7,
                "house": 3,
                "motion": "D"
            },
            "Moon": {
                "degree": 291.3612256081293,
                "cusp_degree": 21.361225608129303,
                "motion_speed": 11.8684735072478,
                "zodiac": 10,
                "house": 6,
                "motion": "D"
            },
            "Venus": {
                "degree": 242.39137699272814,
                "cusp_degree": 2.3913769927281407,
                "motion_speed": 1.0778809965039198,
                "zodiac": 9,
                "house": 5,
                "motion": "D"
            },
            "Mars": {
                "degree": 237.3136951477443,
                "cusp_degree": 27.313695147744312,
                "motion_speed": 0.7415804358444251,
                "zodiac": 8,
                "house": 4,
                "motion": "D"
            },
            "Mercury": {
                "degree": 216.0941218590537,
                "cusp_degree": 6.0941218590537005,
                "motion_speed": 1.3524855614200746,
                "zodiac": 8,
                "house": 4,
                "motion": "D"
            },
            "Saturn": {
                "degree": 317.24323476081054,
                "cusp_degree": 17.243234760810537,
                "motion_speed": -0.021235098224392755,
                "zodiac": 11,
                "house": 7,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 41.61435420573097,
                "cusp_degree": 11.614354205730969,
                "motion_speed": -0.010024014334391157,
                "zodiac": 2,
                "house": 10,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 42.45590420426922,
                "cusp_degree": 12.455904204269217,
                "motion_speed": -0.052992037547475515,
                "zodiac": 2,
                "house": 10,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 222.45590420426922,
                "motion_speed": -0.052992037547475515,
                "cusp_degree": 12.455904204269217,
                "zodiac": 8,
                "house": 4,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 221.61435420573096,
                "motion_speed": -0.010024014334391157,
                "cusp_degree": 11.614354205730962,
                "zodiac": 8,
                "house": 4,
                "motion": "R"
            }
        }
    }
}
