{
    "request": {
        "name": "Sheikh Mujibur Rahman",
        "title": "Politician, Prime Minister",
        "year": 1920,
        "month": 3,
        "day": 17,
        "hour": 23,
        "minute": 30,
        "second": 0,
        "latitude": 22.9053736,
        "longitude": 89.8990776,
        "location": "Tungipara, Bangladesh",
        "agyat_rating": "AA",
        "gender": "male",
        "dod": "15/08/1975",
        "advanced": "legal troubles, detention, gunned-down, death by accident",
        "about": "<p>Sheikh Mujibur Rahman (17 March 1920 – 15 August 1975), also known by the honorific Bangabandhu, was a Bangladeshi politician, revolutionary, statesman and activist who was the founding president of Bangladesh. As the leader of Bangladesh, he led the country either as its president or prime minister from January 1972 until his assassination in a coup d'état in August 1975. His nationalist ideology, socio-political theories, and political doctrines are collectively known as Mujibism.</p><p> Born in an aristocratic Bengali Muslim family in Tungipara, Mujib emerged as a student activist in the province of Bengal during the final years of the British Raj. He was a member of the All India Muslim League, supported Muslim nationalism, and advocated for the establishment of Pakistan in his early political career. In 1949, he was part of a liberal, secular and left-wing faction which later became the Awami League. In the 1950s, he was elected to Pakistan's parliament where he defended the rights of East Bengal. Mujib served 13 years in prison during the British Raj and Pakistani rule.</p><p> By the 1960s, Mujib adopted Bengali nationalism and soon became the undisputed leader of East Pakistan. He became popular for opposing West Pakistan's political, ethnic and institutional discrimination against the Bengalis of East Pakistan; leading the six-point autonomy movement, he challenged the regime of Pakistan's President Ayub Khan. In 1970, he led the Awami League to win Pakistan's first general election. When the Pakistani military junta refused to transfer power, he gave the 7 March speech in 1971 where he vaguely called out for the independence movement. In the late hours of 25 March 1971, the Pakistan Army arrested Sheikh Mujib on charges of treason and carried out a genocide against the Bengali civilians of East Pakistan. In the early hours of the next day (26 March 1971), he issued the Proclamation of Bangladeshi Independence, which was later broadcast by Bengali army officer Maj. Ziaur Rahman on behalf of Sheikh Mujib. which ultimately marked the outbreak of the Bangladesh Liberation War. Bengali nationalists declared him the head of the Provisional Government of Bangladesh, while he was confined in a jail in West Pakistan.</p><p> After the independence of Bangladesh, Mujib returned to Bangladesh in January 1972 as the leader of a war-devastated country. In the following years, he played an important role in rebuilding Bangladesh, constructing a secular constitution for the country, transforming Pakistani era state apparatus, bureaucracy, armed forces, and judiciary into an independent state, initiating the first general election and normalizing diplomatic ties with most of the world. His foreign policy during the time was dominated by the principle \"friendship to all and malice to none\". He remained a close ally to Gandhi's India and Brezhnev's Soviet Union, while balancing ties with the United States. He gave the first Bengali speech to the UN General Assembly in 1974.</p><p> Mujib's government proved largely unsuccessful in curbing political and economic anarchy and corruption in post-independence Bangladesh, which ultimately gave rise to a left-wing insurgency. To quell the insurgency, he formed Jatiya Rakkhi Bahini, a special paramilitary force similar to the Gestapo, which was involved in various human rights abuses, massacres, enforced disappearances, extrajudicial killings and rapes. Mujib's four-year regime was the only socialist period in Bangladesh's history, which was marked with huge economic mismanagement and failure, leading to the high mortality rate in the deadly famine of 1974. In 1975, he launched the Second Revolution, under which he installed a one party regime and abolished all kinds of civil liberties and democratic institutions, by which he \"institutionalized autocracy\" and made himself the \"unimpeachable\" President of Bangladesh, effectively for life, which lasted for seven months. On 15 August 1975, he was assassinated along with most of his family members in his Dhanmondi 32 residence in a coup d'état.</p><p> Sheikh Mujib's post-independence legacy remains divisive among Bangladeshis due to his economic mismanagement, the famine of 1974, human rights violations, and authoritarianism. Nevertheless, most Bangladeshis credit him for leading the country to independence in 1971 and restoring the Bengali sovereignty after over two centuries following the Battle of Plassey in 1757, for which he is honoured as Bangabandhu (lit. 'Friend of Bengal'). He was voted as the Greatest Bengali of all time in the 2004 BBC opinion poll. His 7 March speech in 1971 is recognized by UNESCO for its historic value, and was listed in the Memory of the World Register. Many of his diaries and travelogues were published many years after his death and have been translated into several languages.</p>",
        "related": ["mujib-family"]
    },
    "response": {
        "ascendant": {
            "asc_deg": 226.12471437119345,
            "ascendant": 8
        },
        "planets": {
            "Sun": {
                "degree": 334.0846297140901,
                "cusp_degree": 4.084629714090113,
                "motion_speed": 0.9947522124544763,
                "zodiac": 12,
                "house": 5,
                "motion": "D"
            },
            "Moon": {
                "degree": 300.2114332143129,
                "cusp_degree": 0.21143321431287632,
                "motion_speed": 12.964724949601315,
                "zodiac": 11,
                "house": 4,
                "motion": "D"
            },
            "Mercury": {
                "degree": 338.90851420802625,
                "cusp_degree": 8.908514208026247,
                "motion_speed": -0.7924796659393711,
                "zodiac": 12,
                "house": 5,
                "motion": "R"
            },
            "Venus": {
                "degree": 306.1260069338424,
                "cusp_degree": 6.126006933842405,
                "motion_speed": 1.2271404999769577,
                "zodiac": 11,
                "house": 4,
                "motion": "D"
            },
            "Mars": {
                "degree": 196.3105574522265,
                "cusp_degree": 16.310557452226504,
                "motion_speed": -0.032510562485379604,
                "zodiac": 7,
                "house": 12,
                "motion": "R"
            },
            "Jupiter": {
                "degree": 105.83245925864883,
                "cusp_degree": 15.832459258648825,
                "motion_speed": -0.054603946106065455,
                "zodiac": 4,
                "house": 9,
                "motion": "R"
            },
            "Saturn": {
                "degree": 134.0971479046758,
                "cusp_degree": 14.097147904675808,
                "motion_speed": -0.07276623273201256,
                "zodiac": 5,
                "house": 10,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 204.10625252809868,
                "cusp_degree": 24.10625252809868,
                "motion_speed": -0.14464149344551872,
                "zodiac": 7,
                "house": 12,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 205.57567132555536,
                "cusp_degree": 25.575671325555362,
                "motion_speed": -0.052992015272059594,
                "zodiac": 7,
                "house": 12,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 25.57567132555539,
                "motion_speed": -0.052992015272059594,
                "cusp_degree": 25.57567132555539,
                "zodiac": 1,
                "house": 6,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 24.106252528098707,
                "motion_speed": -0.14464149344551872,
                "cusp_degree": 24.106252528098707,
                "zodiac": 1,
                "house": 6,
                "motion": "R"
            }
        }
    }
}
