{
    "request": {
        "name": "Silvio Berlusconi",
        "title": "Actor",
        "year": 1936,
        "month": 9,
        "day": 29,
        "hour": 5,
        "minute": 30,
        "second": 0,
        "latitude": 45.4641943,
        "longitude": 9.1896346,
        "location": "Milan, Italy",
        "agyat_rating": "AA",
        "gender": "male",
        "about": "<p>Silvio Berlusconi (/ˌbɛərlʊˈskoʊni/ BAIR-luu-SKOH-nee; Italian: [ˈsilvjo berluˈskoːni]; 29 September 1936 – 12 June 2023) was an Italian media tycoon and politician who served as the prime minister of Italy in three governments from 1994 to 1995, 2001 to 2006 and 2008 to 2011. He was a member of the Chamber of Deputies from 1994 to 2013; a member of the Senate of the Republic from 2022 until his death in 2023, and previously from March to November 2013; and a member of the European Parliament (MEP) from 2019 to 2022, and previously from 1999 to 2001. With a net worth of US$6.8 billion in June 2023, Berlusconi was the third-wealthiest person in Italy at the time of his death.</p><p> Berlusconi rose into the financial elite of Italy in the late 1960s. He was the controlling shareholder of Mediaset and owned the Italian football club AC Milan from 1986 to 2017. He was nicknamed Il Cavaliere ('The Knight') for his Order of Merit for Labour; he voluntarily resigned from this order in March 2014. In 2018, Forbes ranked him as the 190th-richest man in the world, with a net worth of US$8 billion. In 2009, Forbes ranked him 12th in the list of the World's Most Powerful People due to his domination of Italian politics throughout more than fifteen years at the head of the centre-right coalition.</p><p> Berlusconi was prime minister for nine years in total, making him the longest serving post-war prime minister of Italy, and the third-longest-serving since Italian unification, after Benito Mussolini and Giovanni Giolitti. He was the leader of the centre-right party Forza Italia from 1994 to 2009, and its successor party The People of Freedom from 2009 to 2013. He led the revived Forza Italia from 2013 to 2023. Berlusconi was the senior G8 leader from 2009 until 2011, and he held the record for hosting G8 summits (having hosted three summits in Italy). After serving nearly 19 years as a member of the Chamber of Deputies, the country's lower house, he became a member of the Senate following the 2013 Italian general election.</p><p> On 1 August 2013, Berlusconi was convicted of tax fraud by the Supreme Court of Cassation. His four-year prison sentence was confirmed, and he was banned from holding public office for two years. Aged 76, he was exempted from direct imprisonment, and instead served his sentence by doing unpaid community service. Three years of his sentence was automatically pardoned under Italian law; because he had been sentenced to gross imprisonment for more than two years, he was banned from holding legislative office for six years and expelled from the Senate. Berlusconi pledged to stay leader of Forza Italia throughout his custodial sentence and public office ban. After his ban ended, Berlusconi ran for and was elected as an MEP at the 2019 European Parliament election. He returned to the Senate after winning a seat in the 2022 Italian general election, then died the following year from complications of chronic leukaemia, and was given a state funeral.</p><p> Berlusconi was known for his populist political style and brash personality. In his long tenure, he was often accused of being an authoritarian leader and a strongman. At the height of his power, Berlusconi was the richest person in Italy, owned three of the main TV channels of the country, and indirectly controlled the national broadcasting company RAI through his own government. He was the owner of Italy's biggest publishing company, several newspapers and magazines, and one of the largest football clubs in Europe. At the time of his death, The Guardian wrote that Berlusconi \"gathered himself more power than was ever wielded by one individual in a Western democracy\". Berlusconi remained a controversial figure who divided public opinion and political analysts. Supporters emphasised his leadership skills and charismatic power, his fiscal policy based on tax reduction, and his ability to maintain strong and close foreign relations with both the United States and Russia. In general, critics address his performance as a politician and the ethics of his government practices in relation to his business holdings. Issues with the former include accusations of having mismanaged the state budget and of increasing the Italian government debt. The second criticism concerns his vigorous pursuit of his personal interests while in office, including benefitting from his own companies' growth due to policies promoted by his governments, having vast conflicts of interest due to ownership of a media empire, and being blackmailed as a leader because of his turbulent private life.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 154.71956205116166,
            "ascendant": 6
        },
        "planets": {
            "Sun": {
                "degree": 162.8748914622753,
                "cusp_degree": 12.874891462275286,
                "motion_speed": 0.9821892564917042,
                "zodiac": 6,
                "house": 1,
                "motion": "D"
            },
            "Moon": {
                "degree": 319.2183000898726,
                "cusp_degree": 19.218300089872628,
                "motion_speed": 14.798863349415559,
                "zodiac": 11,
                "house": 6,
                "motion": "D"
            },
            "Mercury": {
                "degree": 166.7265825398734,
                "cusp_degree": 16.72658253987339,
                "motion_speed": -1.1184922219782436,
                "zodiac": 6,
                "house": 1,
                "motion": "R"
            },
            "Venus": {
                "degree": 187.53769060402007,
                "cusp_degree": 7.537690604020071,
                "motion_speed": 1.2297868371104468,
                "zodiac": 7,
                "house": 2,
                "motion": "D"
            },
            "Mars": {
                "degree": 128.62822656200908,
                "cusp_degree": 8.628226562009075,
                "motion_speed": 0.6231294896660663,
                "zodiac": 5,
                "house": 12,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 235.04451230532763,
                "cusp_degree": 25.04451230532763,
                "motion_speed": 0.13367615828503635,
                "zodiac": 8,
                "house": 3,
                "motion": "D"
            },
            "Saturn": {
                "degree": 324.8599787503741,
                "cusp_degree": 24.859978750374125,
                "motion_speed": -0.07102318833056646,
                "zodiac": 11,
                "house": 6,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 245.29979892285948,
                "cusp_degree": 5.29979892285948,
                "motion_speed": -0.17032772927986556,
                "zodiac": 9,
                "house": 4,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 245.53176874325004,
                "cusp_degree": 5.531768743250041,
                "motion_speed": -0.052992131841358675,
                "zodiac": 9,
                "house": 4,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 65.53176874325004,
                "motion_speed": -0.052992131841358675,
                "cusp_degree": 5.531768743250041,
                "zodiac": 3,
                "house": 10,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 65.29979892285951,
                "motion_speed": -0.17032772927986556,
                "cusp_degree": 5.299798922859509,
                "zodiac": 3,
                "house": 10,
                "motion": "R"
            }
        }
    }
}
