{
    "request": {
        "name": "Zelensky Volodymyr",
        "title": "Politician/Comic",
        "year": 1978,
        "month": 1,
        "day": 25,
        "hour": 14,
        "minute": 0,
        "second": 0,
        "latitude": 47.9102734,
        "longitude": 33.3917703,
        "location": "Kryvyi Rih, Ukraine",
        "agyat_rating": "AA",
        "about": "<p>Volodymyr Oleksandrovych Zelenskyy (born 25 January 1978) is a Ukrainian politician and former entertainer who has served as the sixth and current president of Ukraine since 2019, most notably during the full-scale Russian invasion of Ukraine, which has been ongoing since February 2022.</p><p> Zelenskyy grew up as a native Russian speaker in Kryvyi Rih, a major city of Dnipropetrovsk Oblast in central Ukraine. He obtained a degree in law from the Kryvyi Rih Institute of Economics, but never practised law and pursued a career in comedy and entertainment. He created the production company Kvartal 95, which produced films, cartoons, and TV shows including the TV series Servant of the People, in which Zelenskyy played a fictional Ukrainian president. The series aired from 2015 to 2019 and was immensely popular. A political party with the same name as the TV show was created in March 2018 by employees of Kvartal 95.</p><p> Zelenskyy announced his candidacy in the 2019 presidential election on the evening of 31 December 2018, alongside the New Year's Eve address of then-president Petro Poroshenko on the TV channel 1+1. A political outsider, Zelenskyy positioned himself as an anti-establishment and anti-corruption figure, and had already become one of the frontrunners in opinion polls for the election months before he formally declared his candidacy. He won the election with 73.23 percent of the vote in the second round, defeating Poroshenko in the biggest landslide in the history of Ukrainian presidential elections.</p><p> As president, Zelenskyy has been a proponent of e-government and of unity between the Ukrainian- and Russian-speaking parts of the country's population. He makes extensive use of social media, particularly Instagram. His party won a landslide victory in the snap legislative election held shortly after his inauguration as president. During the first two years of his administration, Zelenskyy oversaw the lifting of legal immunity for members of parliament (the Verkhovna Rada), the country's response to the COVID-19 pandemic and subsequent economic recession, and some limited progress in tackling corruption in Ukraine. A poll in May 2021 by the Rating Group gave Zelenskyy the highest trust rating out of all Ukrainian presidents, and ranked him as the second-best president after Leonid Kuchma.</p><p> During his presidential campaign, Zelenskyy promised to end Ukraine's protracted conflict with Russia, and he has attempted to engage in dialogue with Russian president Vladimir Putin. His administration faced an escalation of tensions with Russia in 2021, culminating in Russia's full-scale invasion of Ukraine in February 2022. Zelenskyy's strategy during the Russian military buildup was to calm the Ukrainian populace and assure the international community that Ukraine was not seeking to retaliate. He initially distanced himself from warnings of an imminent war, while also calling for security guarantees and military support from NATO to \"withstand\" the threat.</p><p> When Russia launched its full-scale invasion, Zelenskyy remained in Kyiv, declining international offers to evacuate him from the capital under attack; he declared martial law across Ukraine and a general mobilisation of the armed forces. Zelenskyy was named the Time Person of the Year for 2022. He has frequently visited frontline and newly liberated areas.</p><p> Zelenskyy's term was originally scheduled to end in May 2024, but the ongoing Russian invasion and the resulting ongoing martial law prevented the regularly scheduled presidential election from being conducted. He is expected to remain president for the duration of the Russo-Ukrainian War. Due to this extension of his term, Zelenskyy is the second-longest serving president in Ukrainian history, after only Kuchma.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 71.8212871358179,
            "ascendant": 3
        },
        "planets": {
            "Sun": {
                "degree": 281.61295984537725,
                "cusp_degree": 11.612959845377247,
                "motion_speed": 1.01626631928835,
                "zodiac": 10,
                "house": 8,
                "motion": "D"
            },
            "Moon": {
                "degree": 114.66012767812526,
                "cusp_degree": 24.660127678125264,
                "motion_speed": 12.255730112001732,
                "zodiac": 4,
                "house": 2,
                "motion": "D"
            },
            "Mercury": {
                "degree": 261.43810071788215,
                "cusp_degree": 21.43810071788215,
                "motion_speed": 1.4054529234548827,
                "zodiac": 9,
                "house": 7,
                "motion": "D"
            },
            "Venus": {
                "degree": 282.38940177593526,
                "cusp_degree": 12.389401775935255,
                "motion_speed": 1.256199061315893,
                "zodiac": 10,
                "house": 8,
                "motion": "D"
            },
            "Mars": {
                "degree": 96.67686882090712,
                "cusp_degree": 6.676868820907117,
                "motion_speed": -0.3927555989528324,
                "zodiac": 4,
                "house": 2,
                "motion": "R"
            },
            "Jupiter": {
                "degree": 63.60061366486495,
                "cusp_degree": 3.6006136648649516,
                "motion_speed": -0.08228287265088334,
                "zodiac": 3,
                "house": 1,
                "motion": "R"
            },
            "Saturn": {
                "degree": 125.25903791803576,
                "cusp_degree": 5.259037918035759,
                "motion_speed": -0.07036169387158347,
                "zodiac": 5,
                "house": 3,
                "motion": "R"
            },
            "Rahu True": {
                "degree": 164.20141828355824,
                "cusp_degree": 14.20141828355824,
                "motion_speed": -0.1630924587290965,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Rahu Mean": {
                "degree": 165.70659187309138,
                "cusp_degree": 15.706591873091384,
                "motion_speed": -0.05299202570117575,
                "zodiac": 6,
                "house": 4,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 345.7065918730914,
                "motion_speed": -0.05299202570117575,
                "cusp_degree": 15.706591873091384,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 344.20141828355827,
                "motion_speed": -0.1630924587290965,
                "cusp_degree": 14.201418283558269,
                "zodiac": 12,
                "house": 10,
                "motion": "R"
            }
        }
    }
}
