{
    "request": {
        "name": "Zulfikar Ali Bhutto",
        "title": "Politician",
        "year": 1928,
        "month": 1,
        "day": 5,
        "hour": 3,
        "minute": 0,
        "second": 0,
        "latitude": 27.5564798,
        "longitude": 68.2101509,
        "location": "Larkana, Sindh, Pakistan",
        "agyat_rating": "AA",
        "about": "<p>Zulfikar Ali Bhutto (5 January 1928 – 4 April 1979) was a Pakistani barrister, politician, and statesman. He served as the fourth president of Pakistan from 1971 to 1973 and later as the ninth prime minister of Pakistan from 1973 to 1977. Bhutto founded the Pakistan People's Party (PPP) and served as its chairman until his execution for murder.</p><p> Born in Sindh and educated at the University of California, Berkeley and the University of Oxford, Bhutto trained as a barrister at Lincoln's Inn before entering politics. Initially, he was a cabinet member during president Iskandar Ali Mirza's tenure, holding various ministries during president Ayub Khan's military rule from 1958. Bhutto became the Foreign Minister in 1963, advocating for Operation Gibraltar in Kashmir, leading to the 1965 war with India. Following the Tashkent Declaration, he was dismissed from the government. Bhutto established the PPP in 1967, focusing on an Islamic socialist agenda, and contested the 1970 general election. The Awami League and PPP were unable to agree on power transfer, leading to civil unrest and the creation of Bangladesh. After Pakistan's loss in the 1971 war against Bangladesh, Bhutto assumed the presidency in December 1971, imposing emergency rule.</p><p> During his presidency, Bhutto secured the release of 93,000 prisoners of war and reclaimed five thousand square miles (13,000 km2) of Indian-held territory through the Simla Agreement. He strengthened diplomatic ties with China and Saudi Arabia, recognized Bangladesh, and hosted the second Organisation of the Islamic Conference in Lahore in 1974. Bhutto's government drafted the current constitution of Pakistan in 1973, after which he transitioned to the prime minister's office. He played a crucial role in initiating the country's nuclear program. However, his policies, including extensive nationalisation, led to economic stagnation.</p><p> Despite winning the 1977 parliamentary elections, Bhutto faced allegations of widespread vote rigging, sparking violence across the country. On 5 July 1977, Bhutto was deposed in a military coup by army chief Muhammad Zia-ul-Haq. Controversially tried and executed in 1979, Bhutto's legacy remains contentious, praised for nationalism and a secular internationalist agenda, yet criticized for political repression, economic challenges, and human rights abuses. He is often considered one of Pakistan's greatest leaders. His party, the PPP, continues to be a significant political force in Pakistan, with his daughter Benazir Bhutto serving twice as Prime Minister, and his son-in-law, Asif Ali Zardari, becoming president.</p>"
    },
    "response": {
        "ascendant": {
            "asc_deg": 209.15068731228683,
            "ascendant": 7
        },
        "planets": {
            "Sun": {
                "degree": 260.4976232188055,
                "cusp_degree": 20.497623218805472,
                "motion_speed": 1.0189375279547914,
                "zodiac": 9,
                "house": 3,
                "motion": "D"
            },
            "Moon": {
                "degree": 49.88212605432784,
                "cusp_degree": 19.88212605432784,
                "motion_speed": 14.389978985790702,
                "zodiac": 2,
                "house": 8,
                "motion": "D"
            },
            "Mercury": {
                "degree": 258.02999077021406,
                "cusp_degree": 18.029990770214056,
                "motion_speed": 1.603959514866348,
                "zodiac": 9,
                "house": 3,
                "motion": "D"
            },
            "Venus": {
                "degree": 218.25693998030428,
                "cusp_degree": 8.256939980304281,
                "motion_speed": 1.1815460293489646,
                "zodiac": 8,
                "house": 2,
                "motion": "D"
            },
            "Mars": {
                "degree": 236.8242063694933,
                "cusp_degree": 26.82420636949331,
                "motion_speed": 0.7252064592326313,
                "zodiac": 8,
                "house": 2,
                "motion": "D"
            },
            "Jupiter": {
                "degree": 334.2197975882295,
                "cusp_degree": 4.219797588229483,
                "motion_speed": 0.14115670872932845,
                "zodiac": 12,
                "house": 6,
                "motion": "D"
            },
            "Saturn": {
                "degree": 231.08197563714813,
                "cusp_degree": 21.081975637148133,
                "motion_speed": 0.10837114496256058,
                "zodiac": 8,
                "house": 2,
                "motion": "D"
            },
            "Rahu True": {
                "degree": 55.778894309431045,
                "cusp_degree": 25.778894309431045,
                "motion_speed": 0.007848612877857139,
                "zodiac": 2,
                "house": 8,
                "motion": "D"
            },
            "Rahu Mean": {
                "degree": 54.59003442076073,
                "cusp_degree": 24.59003442076073,
                "motion_speed": -0.05299200783367717,
                "zodiac": 2,
                "house": 8,
                "motion": "R"
            },
            "Ketu Mean": {
                "degree": 234.59003442076073,
                "motion_speed": -0.05299200783367717,
                "cusp_degree": 24.59003442076073,
                "zodiac": 8,
                "house": 2,
                "motion": "R"
            },
            "Ketu True": {
                "degree": 235.77889430943105,
                "motion_speed": 0.007848612877857139,
                "cusp_degree": 25.778894309431053,
                "zodiac": 8,
                "house": 2,
                "motion": "R"
            }
        }
    }
}
